{
    "name": "HKC Name: American English",
    "intro": "HKC Items English Version",
    "language": "en-us",
    "author": "PHCP Tech",
    "website": "https://hkc.wiki",
    "version": "0.1.0",
    "lastUpdate": "2024-08-31",
    "list": [
        {"code": "000", "name": "Philosophy", "intro": "The study of fundamental questions regarding existence, knowledge, values, reason, mind, and language, exploring various philosophical traditions and theories."},
        {"code": "100", "name": "Religion", "intro": "The exploration of belief systems, practices, and organizational structures that relate humanity to the supernatural or transcendent."},
        {"code": "200", "name": "Society", "intro": "The study of social behavior, institutions, and structures that shape human interactions and relationships within communities."},
        {"code": "300", "name": "Culture", "intro": "The examination of shared beliefs, practices, norms, and artifacts that characterize a group or society, influencing identity and social cohesion."},
        {"code": "400", "name": "Art", "intro": "The exploration of creative expression through various mediums, including visual arts, music, literature, and performance, reflecting cultural values and human experience."},
        {"code": "500", "name": "Science", "intro": "The systematic study of the natural world through observation, experimentation, and analysis, leading to the development of theories and laws."},
        {"code": "600", "name": "Technology", "intro": "The application of scientific knowledge for practical purposes, encompassing tools, machines, and systems that enhance human capabilities."},
        {"code": "700", "name": "New Civilization", "intro": "The study of emerging societal structures and cultural paradigms that arise in response to technological advancements and global changes."},
        {"code": "800", "name": "", "intro": ""},
        {"code": "900", "name": "", "intro": ""},
        {"code": "A00", "name": "", "intro": ""},
        {"code": "B00", "name": "", "intro": ""},
        {"code": "C00", "name": "", "intro": ""},
        {"code": "D00", "name": "", "intro": ""},
        {"code": "E00", "name": "", "intro": ""},
        {"code": "F00", "name": "", "intro": ""},
        {"code": "010", "name": "Metaphysics", "intro": "The branch of philosophy that examines the fundamental nature of reality, including concepts such as being, existence, and the universe."},
        {"code": "020", "name": "Epistemology", "intro": "The study of knowledge, its nature, sources, limitations, and validity, exploring how we know what we know."},
        {"code": "030", "name": "Logic", "intro": "The systematic study of valid reasoning, argumentation, and the principles of correct inference."},
        {"code": "040", "name": "Aesthetics", "intro": "The philosophical exploration of beauty, art, and taste, examining how we perceive and appreciate artistic expressions."},
        {"code": "050", "name": "Ethics", "intro": "The study of moral principles and values that govern individual and societal behavior, exploring concepts of right and wrong."},
        {"code": "060", "name": "Psychology", "intro": "The scientific study of the mind and behavior, exploring mental processes, emotions, and social interactions."},
        {"code": "070", "name": "Vijnanavada", "intro": "A school of Buddhist philosophy that emphasizes the nature of consciousness and the role of perception in understanding reality."},
        {"code": "080", "name": "", "intro": ""},
        {"code": "090", "name": "", "intro": ""},
        {"code": "110", "name": "Hinduism", "intro": "A major world religion originating in the Indian subcontinent, characterized by a variety of beliefs, practices, and rituals."},
        {"code": "120", "name": "Biblical Faiths", "intro": "Religious beliefs that are closely related to the Bible include Judaism, which believes in the Old Testament, and Catholicism, Orthodoxy and Protestantism, which believe in the New Testament."},
        {"code": "130", "name": "Buddhism", "intro": "A spiritual tradition focusing on personal spiritual development and the attainment of a deep insight into the true nature of life."},
        {"code": "140", "name": "Islam", "intro": "A monotheistic faith revealed through the Prophet Muhammad, emphasizing submission to the will of Allah and the teachings of the Quran."},
        {"code": "150", "name": "Bahai", "intro": "A religion emphasizing the spiritual unity of all humankind and the importance of world peace and justice."},
        {"code": "160", "name": "National Religion", "intro": "The study of religious beliefs and practices that are officially recognized or endorsed by a nation."},
        {"code": "170", "name": "", "intro": ""},
		{"code": "180", "name": "", "intro": ""},
        {"code": "190", "name": "", "intro": ""},
        {"code": "210", "name": "Family", "intro": "The study of familial structures, relationships, and dynamics within various cultural contexts."},
        {"code": "220", "name": "Sociology", "intro": "The study of social behavior, institutions, and structures that shape human interactions and relationships."},
        {"code": "230", "name": "Economics", "intro": "The study of the production, distribution, and consumption of goods and services, analyzing how societies allocate resources."},
        {"code": "240", "name": "Politics", "intro": "The study of governance, political processes, and the analysis of political systems and behavior."},
        {"code": "250", "name": "Law", "intro": "The study of legal systems, principles, and practices that govern society and regulate human behavior."},
        {"code": "260", "name": "Nation", "intro": "The study of national identity, sovereignty, and the political and cultural characteristics of nations."},
        {"code": "270", "name": "Globalization", "intro": "The process of increasing interconnectedness and interdependence among countries, cultures, and economies."},
        {"code": "280", "name": "Management", "intro": "The study of organizational structures, processes, and practices aimed at achieving goals and optimizing resources."},
        {"code": "290", "name": "", "intro": ""},
        {"code": "310", "name": "Education", "intro": "The study of teaching and learning processes, educational systems, and the impact of education on society."},
        {"code": "320", "name": "Linguistics", "intro": "The scientific study of language, its structure, development, and the social and cultural contexts in which it is used."},
        {"code": "330", "name": "History", "intro": "The study of past events, societies, and cultures, analyzing their impact on the present and future."},
        {"code": "340", "name": "Anthropology", "intro": "The study of human societies, cultures, and their development, exploring the diversity of human experience."},
        {"code": "350", "name": "National Culture", "intro": "The study of the cultural practices, beliefs, and values that define a nation and its identity."},
        {"code": "360", "name": "", "intro": ""},
        {"code": "370", "name": "", "intro": ""},
        {"code": "380", "name": "", "intro": ""},
        {"code": "390", "name": "", "intro": ""},
        {"code": "410", "name": "Music", "intro": "The study of musical forms, styles, and practices, exploring the cultural significance and emotional impact of music."},
        {"code": "420", "name": "Painting", "intro": "The practice of applying pigment to a surface to create visual art, exploring techniques, styles, and cultural significance."},
        {"code": "430", "name": "Literature", "intro": "The study of written works, including fiction, poetry, and drama, analyzing themes, styles, and cultural contexts."},
        {"code": "440", "name": "Dance and Theater", "intro": "The study of performance arts, including dance and theater, exploring their cultural significance and expressive forms."},
        {"code": "450", "name": "Sculpture", "intro": "The art of creating three-dimensional forms, exploring materials, techniques, and cultural significance."},
        {"code": "460", "name": "Photograph and Movie", "intro": "The study of visual media, including photography and film, analyzing their artistic, cultural, and social impact."},
        {"code": "470", "name": "Games and Sports", "intro": "The study of recreational activities, including games and sports, exploring their cultural significance and impact on society."},
        {"code": "480", "name": "National Art", "intro": "The study of artistic expressions that reflect the cultural identity and heritage of a nation."},
        {"code": "490", "name": "", "intro": ""},
        {"code": "510", "name": "Math", "intro": "The study of numbers, quantities, shapes, and patterns, exploring mathematical theories and their applications."},
        {"code": "520", "name": "Biology", "intro": "The study of living organisms, their structure, function, growth, evolution, and interactions with their environment."},
        {"code": "530", "name": "Physics", "intro": "The study of matter, energy, and the fundamental forces of nature, exploring the laws that govern the physical universe."},
        {"code": "540", "name": "Chemistry", "intro": "The study of substances, their properties, reactions, and the changes they undergo, exploring the composition of matter."},
        {"code": "550", "name": "Geoscience", "intro": "The study of the Earth, its structure, processes, and history, including geology, meteorology, and oceanography."},
        {"code": "560", "name": "Astronomy", "intro": "The study of celestial bodies, space, and the universe as a whole, exploring the origins and evolution of the cosmos."},
        {"code": "570", "name": "", "intro": ""},
        {"code": "580", "name": "", "intro": ""},
        {"code": "590", "name": "", "intro": ""},
        {"code": "610", "name": "Medicine", "intro": "The study of health, disease, and medical practices, exploring the diagnosis, treatment, and prevention of illnesses."},
        {"code": "620", "name": "Agriculture", "intro": "The study of farming, cultivation of plants, and livestock management, exploring sustainable practices and food production."},
        {"code": "630", "name": "Industry", "intro": "The study of manufacturing processes, production systems, and economic factors related to industrial activities."},
        {"code": "640", "name": "Architecture", "intro": "The study of designing and constructing buildings and structures, exploring aesthetics, functionality, and environmental impact."},
        {"code": "650", "name": "Traffic", "intro": "The study of transportation systems, traffic flow, and urban planning, exploring the impact of mobility on society."},
        {"code": "660", "name": "Energy", "intro": "The study of energy sources, production, and consumption, exploring sustainable practices and the impact on the environment."},
        {"code": "670", "name": "Astronautics", "intro": "The study of space travel and exploration, including the design and operation of spacecraft and space missions."},
        {"code": "680", "name": "Information and Communication", "intro": "The study of information systems, communication technologies, and their impact on society and culture."},
		{"code": "690", "name": "", "intro": ""},
        {"code": "710", "name": "Futurology", "intro": "The study of future trends and possibilities, exploring predictions and scenarios for societal and technological developments."},
        {"code": "720", "name": "Artificial Superintelligence", "intro": "Artificial superintelligence is a software-based artificial intelligence  system with an intellectual scope beyond human intelligence. At the most fundamental level, this superintelligent AI has cutting-edge cognitive functions and highly developed thinking skills more advanced than any human."},
        {"code": "730", "name": "Artificial Life", "intro": "The study of life forms created through artificial means, exploring the implications for biology and philosophy."},
        {"code": "740", "name": "Solar Civilization", "intro": "The exploration of societies that utilize solar energy as a primary resource, examining sustainability and technological advancements."},
        {"code": "750", "name": "Galactic Civilization", "intro": "The theoretical study of advanced civilizations that may exist beyond Earth, exploring their potential characteristics and technologies."},
        {"code": "760", "name": "Cosmos Civilization", "intro": "The exploration of civilizations that may exist throughout the universe, examining their development and interactions."},
        {"code": "770", "name": "", "intro": ""},
        {"code": "780", "name": "", "intro": ""},
        {"code": "790", "name": "", "intro": ""},
        {"code": "011", "name": "Ontology", "intro": "The study of being and existence, exploring the nature of reality and the categories of being."},
        {"code": "021", "name": "Theory of Knowledge", "intro": "The study of the nature, sources, and limits of knowledge, exploring how we acquire and validate what we know."},
        {"code": "022", "name": "Empiricism", "intro": "The theory that knowledge is primarily derived from sensory experience, emphasizing observation and experimentation."},
        {"code": "023", "name": "Conceptualism", "intro": "The philosophical view that universals exist only within the mind and have no external reality."},
        {"code": "031", "name": "Informal Logic", "intro": "The study of natural language arguments, focusing on reasoning and fallacies in everyday discourse."},
        {"code": "032", "name": "Formal Logic", "intro": "The study of deductive reasoning and the structure of arguments using formal systems and symbols."},
        {"code": "041", "name": "Art aesthetics", "intro": "The study of beauty and taste in art, exploring the principles that define artistic value and appreciation."},
        {"code": "051", "name": "Meta-ethics", "intro": "The study of the nature of ethics, exploring the meaning of moral terms and the foundations of ethical theories."},
        {"code": "052", "name": "Normative Ethics", "intro": "The study of ethical action, exploring the standards for right and wrong behavior."},
        {"code": "053", "name": "Descriptive Ethics", "intro": "The study of people's beliefs about morality, examining how different cultures and societies understand ethical issues."},
        {"code": "054", "name": "Practical Ethics", "intro": "The application of ethical theory to real-world situations, exploring moral dilemmas in various fields."},
        {"code": "061", "name": "Theoretical psychology", "intro": "The study of the underlying principles and theories that explain psychological phenomena."},
        {"code": "062", "name": "Applied Psychology", "intro": "The application of psychological principles and theories to solve practical problems in various settings."},
        {"code": "101", "name": "Religious Significance", "intro": "The study of the importance and impact of religion on individuals and societies."},
        {"code": "102", "name": "New religion", "intro": "The exploration of newly established religious movements and their beliefs, practices, and societal roles."},
        {"code": "103", "name": "Heresy", "intro": "The study of beliefs or practices that deviate from established religious doctrines."},
        {"code": "111", "name": "Vedism", "intro": "The ancient religious texts and practices of the Vedic tradition in India, focusing on rituals and hymns."},
        {"code": "112", "name": "Brahmanism", "intro": "The religious and philosophical system that developed from Vedic traditions, emphasizing rituals and the role of priests."},
        {"code": "113", "name": "Hinduism", "intro": "A major world religion characterized by a variety of beliefs, practices, and rituals originating in the Indian subcontinent."},
        {"code": "121", "name": "Judaism", "intro": "The monotheistic religion of the Jewish people, encompassing a rich tradition of laws, ethics, and cultural practices."},
        {"code": "122", "name": "Catholicism", "intro": "The largest Christian denomination, led by the Pope, emphasizing tradition, sacraments, and the authority of the Church."},
        {"code": "123", "name": "Eastern Orthodoxy", "intro": "The branch of Christianity that adheres to traditional beliefs and practices, particularly in Eastern Europe and the Middle East."},
        {"code": "124", "name": "Protestantism", "intro": "A branch of Christianity that emerged from the Reformation, emphasizing individual faith and the authority of Scripture."},
        {"code": "131", "name": "Southern Buddhism", "intro": "The branch of Buddhism practiced primarily in Southeast Asia, focusing on the teachings of the historical Buddha."},
        {"code": "132", "name": "Chinese Buddhism", "intro": "The adaptation of Buddhism in China, incorporating local beliefs and practices, and influencing Chinese culture."},
        {"code": "133", "name": "Tibetan Buddhism", "intro": "A form of Buddhism that developed in Tibet, characterized by unique practices, rituals, and teachings."},
        {"code": "141", "name": "Sunnite", "intro": "The largest denomination of Islam, following the teachings and practices of the Prophet Muhammad as recorded in the Hadith."},
        {"code": "142", "name": "Shiah", "intro": "The second-largest denomination of Islam, believing in the leadership of Ali and his descendants as the rightful successors to Muhammad."},
        {"code": "161", "name": "Taoism", "intro": "A philosophical and religious tradition from China emphasizing living in harmony with the Tao, or the fundamental nature of the universe."},
        {"code": "162", "name": "Shintoism", "intro": "The traditional religion of Japan, focusing on ritual practices to connect with kami, or spirits associated with natural elements."},
        {"code": "163", "name": "Sikhism", "intro": "Sikhism is a monotheistic religion founded in the Punjab region of India, emphasizing equality, service, and devotion."},
        {"code": "211", "name": "Sexes", "intro": "The study of gender differences, roles, and identities within various cultural and social contexts."},
        {"code": "212", "name": "Marriage", "intro": "The study of the institution of marriage, its cultural significance, and the dynamics of marital relationships."},
        {"code": "213", "name": "Parenting", "intro": "The study of child-rearing practices, parental roles, and the impact of parenting on child development."},
        {"code": "221", "name": "Organization", "intro": "The study of how groups are structured and managed to achieve specific goals and objectives."},
        {"code": "222", "name": "Social System", "intro": "The study of the complex network of relationships and institutions that shape society."},
        {"code": "223", "name": "Social Process", "intro": "The study of the dynamic interactions and changes within societies over time."},
        {"code": "224", "name": "Social Issues", "intro": "The examination of societal problems and challenges, including inequality, discrimination, and social justice."},
        {"code": "231", "name": "Microeconomics", "intro": "The study of individual economic agents, such as households and firms, and their decision-making processes."},
        {"code": "232", "name": "Macroeconomics", "intro": "The study of the economy as a whole, focusing on aggregate indicators and economic policies."},
        {"code": "233", "name": "International Economics", "intro": "The study of economic interactions between countries, including trade, investment, and currency exchange."},
        {"code": "241", "name": "Political Theory", "intro": "The study of political ideas, concepts, and ideologies, exploring the nature of power and governance."},
        {"code": "242", "name": "Comparative Politics", "intro": "The study of political systems and behaviors across different countries, analyzing similarities and differences."},
        {"code": "243", "name": "Public Administration", "intro": "The study of government policies, management practices, and the implementation of public programs."},
        {"code": "244", "name": "Political Economy", "intro": "The study of the relationship between politics and economics, exploring how political institutions influence economic policies."},
        {"code": "245", "name": "International Relations", "intro": "The study of interactions between countries, including diplomacy, conflict, and cooperation."},
        {"code": "251", "name": "Constitution", "intro": "The study of the fundamental principles and laws that govern a state or organization."},
        {"code": "252", "name": "Property Law", "intro": "The study of laws governing the ownership and use of property, including real estate and personal property."},
        {"code": "253", "name": "Criminal Law", "intro": "The study of laws related to crimes and their punishments, focusing on the legal system's role in maintaining order."},
        {"code": "254", "name": "Administrative Law", "intro": "The study of regulations and rules governing the activities of administrative agencies of government."},
        {"code": "255", "name": "International Law", "intro": "The study of legal principles governing relations between nations, including treaties and customary law."},
        {"code": "261", "name": "State", "intro": "The study of the organization and functioning of the state, including its institutions and authority."},
        {"code": "262", "name": "Foreign Affairs", "intro": "The study of a country's relationships with other nations, including diplomacy and international policy."},
        {"code": "263", "name": "Military", "intro": "The study of armed forces, military strategy, and the role of the military in society."},
        {"code": "271", "name": "Economic Globalization", "intro": "The process of increasing economic interdependence among countries, characterized by trade, investment, and capital flows."},
        {"code": "272", "name": "Political Globalization", "intro": "The spread of political ideas and practices across borders, influencing governance and international relations."},
        {"code": "273", "name": "Cultural Globalization", "intro": "The worldwide exchange and integration of cultural practices, ideas, and values."},
        {"code": "274", "name": "Global Governance", "intro": "The study of international cooperation and the management of global issues through institutions and agreements."},
        {"code": "281", "name": "Project Management", "intro": "The discipline of planning, executing, and closing projects, focusing on achieving specific goals within constraints."},
        {"code": "282", "name": "Business Management", "intro": "The study of organizational practices and strategies to effectively manage resources and achieve business objectives."},
        {"code": "283", "name": "Administrative Management", "intro": "The study of organizational structure and processes to improve efficiency and effectiveness in administration."},
        {"code": "311", "name": "Preschool Education", "intro": "The study of early childhood education practices and their impact on child development."},
        {"code": "312", "name": "Primary Education", "intro": "The study of foundational education for children, focusing on literacy, numeracy, and social skills."},
        {"code": "313", "name": "Secondary Education", "intro": "The study of education for adolescents, preparing them for higher education and vocational training."},
        {"code": "314", "name": "Lifelong Education", "intro": "The ongoing, voluntary, and self-motivated pursuit of knowledge for personal or professional development."},
        {"code": "315", "name": "Administrative", "intro": "The study of administrative processes and practices within organizations."},
        {"code": "316", "name": "Library Science", "intro": "The study of managing libraries and information resources, focusing on organization, access, and preservation."},
        {"code": "321", "name": "Sociolinguistics", "intro": "The study of how language varies and changes in social contexts, examining the relationship between language and society."},
        {"code": "322", "name": "Psycholinguistics", "intro": "The study of the interrelation between linguistic and psychological factors, exploring how language is processed in the mind."},
        {"code": "323", "name": "Neurolinguistics", "intro": "The study of the neural mechanisms underlying language processing and production."},
        {"code": "324", "name": "Theoretical Linguistics", "intro": "The study of the abstract principles and structures that govern language."},
        {"code": "331", "name": "History", "intro": "The study of past events, societies, and cultures, analyzing their impact on the present and future."},
        {"code": "332", "name": "Philology", "intro": "The study of language in historical texts, focusing on the development and evolution of languages."},
        {"code": "333", "name": "Journalism", "intro": "The practice of gathering, assessing, creating, and presenting news and information to the public."},
        {"code": "341", "name": "Biological Anthropology", "intro": "The study of the biological and evolutionary aspects of humans, including genetics and human evolution."},
        {"code": "342", "name": "Linguistic Anthropology", "intro": "The study of how language influences social life, exploring the relationship between language and culture."},
        {"code": "341", "name": "Cultural Anthropology", "intro": "The study of cultural variation among humans, examining social practices, beliefs, and values."},
        {"code": "344", "name": "Archeology", "intro": "The study of human history and prehistory through excavation and analysis of artifacts, structures, and other physical remains."},
        {"code": "351", "name": "Chinese Saint Culture", "intro": "The study of the cultural and religious practices surrounding saints in Chinese tradition."},
        {"code": "352", "name": "Brazil Carnival", "intro": "The study of the cultural significance and practices associated with the Brazilian Carnival, a major festival."},
        {"code": "411", "name": "Music Theory", "intro": "The study of the practices and possibilities of music, including the analysis of musical structures and systems."},
        {"code": "412", "name": "Vocal Music", "intro": "The study of music performed by the human voice, exploring techniques, styles, and cultural significance."},
        {"code": "413", "name": "Instrumental Music", "intro": "The study of music created using instruments, examining various genres and their cultural contexts."},
        {"code": "414", "name": "Western Music", "intro": "The study of music traditions originating from Western cultures, including classical, folk, and popular music."},
        {"code": "415", "name": "Chinese Music", "intro": "The study of traditional and contemporary music from China, exploring its cultural significance and forms."},
        {"code": "416", "name": "India Music", "intro": "The study of the diverse musical traditions of India, including classical, folk, and contemporary styles."},
        {"code": "417", "name": "Electronic Music", "intro": "The study of music produced using electronic devices and technology, exploring its evolution and cultural impact."},
        {"code": "421", "name": "Prehistoric Painting", "intro": "The study of ancient artistic expressions found in archaeological sites, exploring their cultural and historical significance."},
        {"code": "422", "name": "Chinese Painting", "intro": "The study of traditional and contemporary painting styles in China, examining techniques and cultural influences."},
        {"code": "423", "name": "Chinese Calligraphy", "intro": "The art of beautiful handwriting in Chinese culture, exploring its techniques, styles, and historical significance."},
        {"code": "424", "name": "Sketch", "intro": "The practice of drawing quickly to capture the essence of a subject, exploring techniques and artistic expression."},
        {"code": "425", "name": "Watercolor Painting", "intro": "The art of painting with water-soluble pigments, exploring techniques and the unique qualities of watercolor."},
        {"code": "426", "name": "Painting", "intro": "The practice of applying pigment to a surface to create visual art, exploring various styles and cultural significance."},
        {"code": "431", "name": "Poetry", "intro": "The study of literary forms that express ideas and emotions through rhythm, meter, and imagery."},
        {"code": "432", "name": "Prose", "intro": "The study of written language in its ordinary form, exploring narrative techniques and styles."},
        {"code": "433", "name": "Script", "intro": "The study of written characters and their use in communication, exploring various writing systems."},
        {"code": "434", "name": "Fiction", "intro": "The study of imaginative narratives that explore human experiences, emotions, and ideas."},
        {"code": "441", "name": "Participatory Dance", "intro": "The study of dance forms that involve audience participation, exploring cultural significance and community engagement."},
        {"code": "442", "name": "Performance Dance", "intro": "The study of dance as a performance art, exploring choreography, expression, and cultural contexts."},
        {"code": "443", "name": "Straight Play", "intro": "The study of non-musical theatrical performances, focusing on script, acting, and stagecraft."},
        {"code": "444", "name": "Opera", "intro": "The study of a dramatic art form that combines singing, orchestration, and theatrical performance."},
        {"code": "445", "name": "Chinese Opera", "intro": "The study of traditional Chinese theatrical performance, characterized by music, vocal performance, and elaborate costumes."},
        {"code": "446", "name": "Stage Show", "intro": "The study of live performances on stage, exploring various forms of entertainment and artistic expression."},
        {"code": "451", "name": "Sculpture", "intro": "The art of creating three-dimensional forms, exploring materials, techniques, and cultural significance."},
        {"code": "452", "name": "Ceramic", "intro": "The study of pottery and ceramic art, exploring techniques, materials, and cultural significance."},
        {"code": "453", "name": "Jewelry", "intro": "The art of creating decorative items worn for personal adornment, exploring materials, techniques, and cultural significance."},
        {"code": "461", "name": "Photography", "intro": "The art and practice of capturing images using light, exploring techniques and cultural significance."},
        {"code": "462", "name": "Film", "intro": "The study of motion pictures as an art form, exploring narrative, cinematography, and cultural impact."},
        {"code": "471", "name": "Games", "intro": "The study of structured forms of play, exploring their cultural significance and impact on society."},
        {"code": "472", "name": "Computer Games", "intro": "The study of digital games, exploring their design, mechanics, and cultural impact."},
        {"code": "473", "name": "Sports Classification", "intro": "The study of categorizing sports based on various criteria, exploring their significance and organization."},
        {"code": "474", "name": "Sports Games", "intro": "The study of competitive physical activities, exploring their rules, organization, and cultural significance."},
        {"code": "481", "name": "Chinese Cross Talk", "intro": "A traditional Chinese comedic performance art that involves witty dialogue and storytelling."},
        {"code": "482", "name": "Indian Song and Dance", "intro": "The study of traditional Indian performance arts that combine music and dance, exploring cultural significance and styles."},
        {"code": "511", "name": "Pure Mathematics", "intro": "The study of mathematical concepts independent of any application outside mathematics, focusing on abstract structures and theoretical frameworks."},
        {"code": "512", "name": "Discrete Mathematics", "intro": "The branch of mathematics dealing with discrete elements that uses algebra and arithmetic, including topics such as graph theory and combinatorics."},
        {"code": "513", "name": "Applied Mathematics", "intro": "The application of mathematical methods by different fields such as science and engineering, focusing on practical problems and solutions."},
        {"code": "521", "name": "Biotaxonomy", "intro": "The classification of living organisms based on biological characteristics, emphasizing the relationships and hierarchies among species."},
        {"code": "522", "name": "Genetics", "intro": "The study of genes, genetic variation, and heredity in living organisms, exploring how traits are passed from one generation to the next."},
        {"code": "523", "name": "Evolution", "intro": "The study of the processes that have led to the diversity of life on Earth, focusing on natural selection, adaptation, and speciation."},
        {"code": "524", "name": "Form and Function", "intro": "The study of the relationship between the structure of biological organisms and their functions, exploring how form influences performance."},
        {"code": "525", "name": "Ecology", "intro": "The study of interactions between organisms and their environment, focusing on ecosystems, biodiversity, and the impact of human activity."},
        {"code": "526", "name": "Gene", "intro": "The basic unit of heredity in living organisms, consisting of DNA and responsible for the transmission of traits."},
        {"code": "531", "name": "Classical Physics", "intro": "The study of the fundamental principles of physics, including mechanics, thermodynamics, and electromagnetism, before the advent of modern physics."},
        {"code": "532", "name": "Condensed Matter Physics", "intro": "The study of the physical properties of condensed phases of matter, such as solids and liquids, focusing on phenomena like superconductivity and crystallography."},
        {"code": "533", "name": "Atomic Physics", "intro": "The study of atoms as isolated systems, focusing on the structure of the atom, electron configurations, and atomic interactions."},
        {"code": "534", "name": "Particle Physics", "intro": "The branch of physics that studies the fundamental particles of the universe and their interactions, exploring the nature of matter and energy."},
        {"code": "541", "name": "Inorganic Chemistry", "intro": "The study of inorganic compounds, focusing on their properties, reactions, and applications, excluding organic compounds."},
        {"code": "542", "name": "Organic Chemistry", "intro": "The study of the structure, properties, composition, reactions, and synthesis of carbon-containing compounds."},
        {"code": "543", "name": "Physical Chemistry", "intro": "The study of the physical properties and behavior of chemical systems, combining principles of physics and chemistry."},
        {"code": "544", "name": "Analytical Chemistry", "intro": "The study of the techniques and methods used to determine the composition of substances, focusing on qualitative and quantitative analysis."},
        {"code": "551", "name": "Geography", "intro": "The study of the Earth's landscapes, environments, and the relationships between people and their environments."},
        {"code": "552", "name": "Geology", "intro": "The study of the Earth, its materials, processes, and history, focusing on the formation and evolution of the planet."},
        {"code": "553", "name": "Geophysics", "intro": "The study of the physical properties and processes of the Earth, using principles of physics to understand geological phenomena."},
        {"code": "554", "name": "Oceanography", "intro": "The study of the ocean, including its ecosystems, currents, and geology, focusing on the interactions between the ocean and the atmosphere."},
        {"code": "555", "name": "Atmospheric", "intro": "The study of the Earth's atmosphere, including weather, climate, and atmospheric processes."},
        {"code": "561", "name": "Observational Astronomy", "intro": "The study of celestial objects and phenomena through observation, using telescopes and other instruments to gather data."},
        {"code": "562", "name": "Solar Astronomy", "intro": "The study of the Sun, its structure, behavior, and impact on the solar system."},
        {"code": "563", "name": "Planetary Science", "intro": "The study of planets, moons, and planetary systems, focusing on their formation, evolution, and geology."},
        {"code": "564", "name": "Stellar Astronomy", "intro": "The study of stars, their formation, evolution, and death, including phenomena such as supernovae and black holes."},
        {"code": "565", "name": "Galactic Astronomy", "intro": "The study of galaxies, their structure, dynamics, and the processes that govern their formation and evolution."},
        {"code": "566", "name": "Extragalactic Astronomy", "intro": "The study of astronomical objects outside our galaxy, including other galaxies and cosmic structures."},
        {"code": "567", "name": "Cosmology", "intro": "The study of the universe as a whole, including its origins, evolution, and eventual fate."},
        {"code": "568", "name": "Astrophysics", "intro": "The branch of astronomy that applies the principles of physics to understand celestial bodies and phenomena."},
        {"code": "569", "name": "Astrochemistry", "intro": "The study of the chemical composition and processes of celestial bodies and the interstellar medium."},
        {"code": "56A", "name": "Astrobiology", "intro": "The study of the origin, evolution, and potential for life in the universe, including the search for extraterrestrial life."},
        {"code": "611", "name": "Traditional Chinese Medicine", "intro": "A holistic approach to health and wellness based on ancient Chinese practices, including acupuncture, herbal medicine, and dietary therapy."},
        {"code": "612", "name": "Human Body Sciences", "intro": "The study of the human body, its structure, function, and the biological processes that sustain life."},
        {"code": "613", "name": "Basic Medicine", "intro": "The foundational study of medical principles, practices, and the biological sciences that underpin health care."},
        {"code": "614", "name": "Clinical Medicine", "intro": "The branch of medicine that deals with the diagnosis and treatment of patients, focusing on practical applications of medical knowledge."},
        {"code": "621", "name": "Crop Farming", "intro": "The practice of cultivating crops for food, fiber, and other products, focusing on agricultural techniques and sustainability."},
        {"code": "622", "name": "Animal Husbandry", "intro": "The practice of breeding and raising livestock for food, fiber, and other products, focusing on animal care and management."},
        {"code": "623", "name": "Fishery", "intro": "The study and practice of catching, breeding, and harvesting fish and other aquatic organisms for food and other uses."},
        {"code": "624", "name": "Forestry", "intro": "The management and study of forests, focusing on conservation, sustainability, and the economic use of forest resources."},
        {"code": "631", "name": "Light Industry", "intro": "The sector of industry that produces consumer goods, focusing on manufacturing processes and economic impact."},
        {"code": "632", "name": "Chemical Industry", "intro": "The sector of industry that produces chemicals and related products, focusing on processes, safety, and environmental impact."},
        {"code": "633", "name": "Steel", "intro": "The study and production of steel, focusing on metallurgy, manufacturing processes, and applications in construction and industry."},
        {"code": "634", "name": "Auto", "intro": "The study of automobile design, manufacturing, and technology, focusing on engineering and innovation in the automotive industry."},
        {"code": "635", "name": "Ship", "intro": "The study of ship design, construction, and operation, focusing on maritime engineering and navigation."},
        {"code": "636", "name": "Airplane", "intro": "The study of aircraft design, manufacturing, and operation, focusing on aerodynamics and aviation technology."},
        {"code": "637", "name": "Military Industry", "intro": "The sector of industry that produces military equipment and technology, focusing on defense and security applications."},
        {"code": "638", "name": "Material", "intro": "The study of materials, their properties, and applications in various fields, including engineering and manufacturing."},
        {"code": "641", "name": "Architectural Theory", "intro": "The study of the principles and concepts that inform architectural design and practice."},
        {"code": "642", "name": "Architectural History", "intro": "The study of the historical development of architecture, exploring styles, movements, and cultural influences."},
        {"code": "643", "name": "Architectural Aesthetics", "intro": "The study of the aesthetic aspects of architecture, focusing on beauty, form, and the sensory experience of built environments."},
        {"code": "651", "name": "Land Carriage", "intro": "The study of transportation methods and systems for moving goods and people over land."},
        {"code": "652", "name": "Water Carriage", "intro": "The study of transportation methods and systems for moving goods and people over water."},
        {"code": "653", "name": "Air Express", "intro": "The study of air transportation systems for the rapid delivery of goods and services."},
        {"code": "661", "name": "Coal", "intro": "The study of coal as a fossil fuel, focusing on its extraction, processing, and environmental impact."},
        {"code": "662", "name": "Petroleum", "intro": "The study of petroleum as a natural resource, focusing on its extraction, refining, and applications in energy and industry."},
        {"code": "663", "name": "Natural Gas", "intro": "The study of natural gas as an energy source, focusing on its extraction, processing, and environmental considerations."},
        {"code": "664", "name": "Water Energy", "intro": "The study of energy derived from water sources, including hydropower and its applications."},
        {"code": "665", "name": "Wind Energy", "intro": "The study of energy generated from wind, focusing on technology, applications, and environmental impact."},
        {"code": "666", "name": "Electricity", "intro": "The study of electrical energy, its generation, transmission, and applications in various fields."},
        {"code": "667", "name": "Solar Energy", "intro": "The study of energy harnessed from the sun, focusing on solar technology and its applications."},
        {"code": "668", "name": "Geothermal Energy", "intro": "The study of energy derived from the Earth's internal heat, focusing on its applications and sustainability."},
        {"code": "669", "name": "Marine Energy", "intro": "The study of energy derived from oceanic sources, including tidal and wave energy."},
        {"code": "66A", "name": "Hydrogen Energy", "intro": "The study of hydrogen as an energy source, focusing on its production, storage, and applications."},
        {"code": "66B", "name": "Nuclear Energy", "intro": "The study of energy produced through nuclear reactions, focusing on its applications and safety considerations."},
        {"code": "671", "name": "Aeronautics", "intro": "The study of the design and operation of aircraft, focusing on aerodynamics and aviation technology."},
        {"code": "672", "name": "Astronautics", "intro": "The study of space travel and exploration, including the design and operation of spacecraft."},
        {"code": "673", "name": "Spacecraft", "intro": "The study of vehicles designed for travel or operation in outer space, focusing on engineering and technology."},
        {"code": "681", "name": "Electronics", "intro": "The study of electronic devices and circuits, focusing on their design, function, and applications."},
        {"code": "682", "name": "Computer", "intro": "The study of computer systems, including hardware, software, and applications in various fields."},
        {"code": "683", "name": "Communication", "intro": "The study of communication systems and technologies, focusing on information transfer and media."},
        {"code": "684", "name": "Control and Automation", "intro": "The study of systems that manage and control processes automatically, focusing on engineering and technology."},
        {"code": "700.1", "name": "West World", "intro": "The science fiction film and television series \"West world\" explores the conflict and development between humans and intelligent robots in the future world."},
        {"code": "700.2", "name": "Frankenstein", "intro": "The study of Mary Shelley's novel and its themes of creation, responsibility, and the consequences of scientific exploration."},
        {"code": "700.3", "name": "The Expanse", "intro": "The exploration of the science fiction series, focusing on its themes of politics, society, and space exploration."},
        {"code": "700.4", "name": "Lama Civilization", "intro": "The study of fictional civilizations in literature and media, exploring their cultural and societal structures."},
        {"code": "700.5", "name": "Cylons Civilization", "intro": "The exploration of the Cylon race in science fiction, focusing on themes of artificial intelligence and identity."},
        {"code": "700.6", "name": "Atlantis Civilization", "intro": "The study of the myth of Atlantis, exploring its cultural significance and representations in literature."},
        {"code": "700.7", "name": "Xenomorph Civilization", "intro": "The exploration of the Xenomorph species in science fiction, focusing on their biology and role in the narrative."},
        {"code": "741", "name": "Interplanetary Travel", "intro": "The study of travel between planets in the solar system, such as from Earth to Mars."},
        {"code": "751", "name": "Interstellar Travel", "intro": "The study of theoretical technologies that enable travel between stars, exploring concepts and implications for humanity."},
        {"code": "752", "name": "Interstellar Migration Social Infrastructure", "intro": "The exploration of the social and infrastructural challenges associated with human migration to other star systems."},
        {"code": "761", "name": "Intergalactic Travel", "intro": "Research the navigation theories and technologies for flying to other galaxies outside the Milky Way."},
        {"code": "021.1", "name": "Knowledge Classification", "intro": "The study of systems and methods for organizing and categorizing knowledge across various fields."},
        {"code": "132.0", "name": "Overview", "intro": "A general introduction to a subject, providing context and foundational knowledge."},
        {"code": "132.1", "name": "Doctrine", "intro": "The study of established beliefs and principles within a particular field or ideology."},
        {"code": "132.2", "name": "Classic", "intro": "The exploration of timeless works and ideas that have significantly influenced culture and thought."},
        {"code": "132.3", "name": "Sect", "intro": "The study of subgroups within a larger religious or ideological framework, focusing on their beliefs and practices."},
        {"code": "132.4", "name": "History", "intro": "The study of past events and their impact on the present and future."},
        {"code": "132.5", "name": "VIP", "intro": "The study of individuals who hold significant influence or status within a particular context."},
        {"code": "132.6", "name": "Culture", "intro": "The exploration of shared beliefs, practices, and values that characterize a group or society."},
        {"code": "413.1", "name": "Piano", "intro": "The study of the piano as a musical instrument, focusing on its history, techniques, and repertoire."},
        {"code": "511.1", "name": "Number", "intro": "The study of numerical concepts, including types of numbers and their properties."},
        {"code": "511.2", "name": "Number Theory", "intro": "The branch of mathematics devoted to the study of integers and their properties."},
        {"code": "511.3", "name": "Group Theory", "intro": "The study of algebraic structures known as groups, focusing on their properties and applications."},
        {"code": "511.4", "name": "Graph Theory", "intro": "The study of graphs and their properties, focusing on relationships and connections between objects."},
        {"code": "511.5", "name": "Order Theory", "intro": "The study of order relations and their properties within mathematical structures."},
        {"code": "511.6", "name": "Geometry", "intro": "The study of shapes, sizes, and properties of space, focusing on points, lines, surfaces, and solids."},
        {"code": "511.7", "name": "Trigonometry", "intro": "The study of the relationships between the angles and sides of triangles."},
        {"code": "511.8", "name": "Differential Geometry", "intro": "The study of geometric properties and structures using calculus."},
        {"code": "511.9", "name": "Topology", "intro": "The study of properties of space that are preserved under continuous transformations."},
        {"code": "511.10", "name": "Fractal", "intro": "The study of complex geometric shapes that can be split into parts, each of which is a reduced-scale copy of the whole."},
        {"code": "511.11", "name": "Measure", "intro": "The study of quantitative properties of sets, focusing on concepts of size and volume."},
        {"code": "511.12", "name": "Calculus", "intro": "The study of change and motion, focusing on derivatives and integrals."},
        {"code": "511.13", "name": "Vector Calculus", "intro": "The study of vector fields and operations on them, including differentiation and integration."},
        {"code": "511.14", "name": "Differential Equation", "intro": "The study of equations involving derivatives, focusing on their solutions and applications."},
        {"code": "511.15", "name": "Dynamical System", "intro": "The study of systems that evolve over time according to specific rules."},
        {"code": "511.16", "name": "Chaos Theory", "intro": "The study of complex systems that are highly sensitive to initial conditions, leading to unpredictable behavior."},
        {"code": "511.17", "name": "Complex Analysis", "intro": "The study of functions that operate on complex numbers, focusing on their properties and applications."},
        {"code": "512.1", "name": "Combinatorics", "intro": "The study of counting, arrangement, and combination of objects."},
        {"code": "512.2", "name": "Theory of Computation", "intro": "The study of computational models and their capabilities, focusing on what can be computed."},
        {"code": "512.3", "name": "Cryptography", "intro": "The study of techniques for secure communication and data protection."},
        {"code": "512.4", "name": "Graph Theory", "intro": "The study of graphs, focusing on their properties and applications in various fields."},
        {"code": "513.1", "name": "Mathematical Physics", "intro": "The study of mathematical methods and their applications to problems in physics."},
        {"code": "513.2", "name": "Numerical Analysis", "intro": "The study of algorithms for approximating solutions to mathematical problems."},
        {"code": "513.3", "name": "Probability Theory", "intro": "The study of randomness and uncertainty, focusing on the mathematical framework for analyzing random events."},
        {"code": "513.4", "name": "Statistics", "intro": "The study of data collection, analysis, interpretation, and presentation."},
        {"code": "513.5", "name": "Game Theory", "intro": "The study of strategic interactions among rational decision-makers."},
        {"code": "513.6", "name": "Operations Research", "intro": "The study of optimization and decision-making in complex systems."},
        {"code": "513.7", "name": "Control Theory", "intro": "The study of how to manipulate the behavior of dynamical systems."},
        {"code": "526.1", "name": "Gene Editing(FIR)", "intro": "The study of techniques for altering the genetic material of organisms."},
        {"code": "531.1", "name": "Classical Mechanics", "intro": "The study of the motion of objects and the forces acting on them."},
        {"code": "531.2", "name": "Acoustics", "intro": "The study of sound, its production, transmission, and effects."},
        {"code": "531.3", "name": "Optics", "intro": "The study of light and its interactions with matter."},
        {"code": "531.4", "name": "Thermodynamics", "intro": "The study of heat, energy, and the laws governing their interactions."},
        {"code": "531.5", "name": "Electromagnetism", "intro": "The study of electric and magnetic fields and their interactions."},
        {"code": "561.1", "name": "Astrometry", "intro": "The study of the positions and movements of celestial bodies."},
        {"code": "561.2", "name": "Visible-Light Astronomy", "intro": "The study of celestial objects using visible light."},
        {"code": "561.3", "name": "Infrared Astronomy", "intro": "The study of celestial objects using infrared radiation."},
        {"code": "561.4", "name": "Radio Astronomy", "intro": "The study of celestial objects using radio waves."},
        {"code": "561.5", "name": "High Energy Astronomy", "intro": "The study of astronomical phenomena that emit high-energy radiation."},
        {"code": "561.6", "name": "Gravitational-Wave Astronomy", "intro": "The study of gravitational waves and their implications for understanding the universe."},
        {"code": "638.1", "name": "Non-Metal", "intro": "The study of materials that are not classified as metals, focusing on their properties and applications."},
        {"code": "638.2", "name": "Metal", "intro": "The study of metallic materials, their properties, and their applications in various industries."},
        {"code": "638.3", "name": "Semiconductor", "intro": "The study of semiconductor materials and devices, focusing on their applications in electronics and technology."},
        {"code": "638.4", "name": "Superconducting", "intro": "The study of superconducting materials and their applications, focusing on zero electrical resistance and magnetic properties."},
        {"code": "638.5", "name": "Polymer", "intro": "The study of polymers, their properties, synthesis, and applications in various fields, including materials science."},
        {"code": "638.6", "name": "Composite Material", "intro": "The study of composite materials, which are made from two or more constituent materials, focusing on their properties and applications."},
        {"code": "638.7", "name": "Nano Material", "intro": "The study of materials at the nanoscale, focusing on their unique properties and potential applications in technology and medicine."},
        {"code": "66B.1", "name": "Nuclear Fusion(FIR)", "intro": "The study of nuclear fusion processes and their potential for energy production."},
        {"code": "682.0", "name": "Introduction", "intro": "Introduces computer fundamentals, covering hardware, software, operating systems, networking, and basic programming, helping understand how computers work."},
        {"code": "682.1", "name": "Operating System", "intro": "The study of software that manages computer hardware and software resources."},
        {"code": "682.2", "name": "Programming Language", "intro": "The study of formal languages used to communicate instructions to a computer."},
        {"code": "682.3", "name": "Software Engineering", "intro": "The study of the principles and practices of software development."},
        {"code": "682.4", "name": "Database", "intro": "The study of structured data storage and management systems."},
        {"code": "682.5", "name": "Network And Security", "intro": "The study of computer networks and the measures taken to protect data and systems."},
        {"code": "682.6", "name": "Cloud Computing", "intro": "The study of internet-based computing that provides shared resources and services."},
        {"code": "682.7", "name": "Big Data", "intro": "The study of large and complex data sets, focusing on analysis and processing techniques."},
        {"code": "682.8", "name": "Blockchain", "intro": "The study of decentralized digital ledgers that record transactions across multiple computers."},
        {"code": "682.9", "name": "Artificial Intelligence(FIR)", "intro": "The study of creating systems that can perform tasks that typically require human intelligence."},
        {"code": "682.10", "name": "Quantum Computing(FIR)", "intro": "The study of computing systems that utilize quantum mechanics to process information."},
        {"code": "682.11", "name": "Application", "intro": "The study of software applications and their development for various purposes."},
		{"code": "751.1", "name": "Warp Drive(FTL)", "intro": "The theoretical study of faster-than-light travel technology, exploring concepts and implications for space exploration."},		
		{"code": "751.2", "name": "Wormholes(FTL)", "intro": "By connecting space-time tunnels in different areas of the universe, it is possible to travel across long distances instantly."},
		{"code": "751.3", "name": "Quantum Tunneling Drive(FTL)", "intro": "The tunneling effect based on quantum mechanics allows the spacecraft to teleport to the distant parts of interstellar space without the need for gradual acceleration."},
        {"code": "413.1.0", "name": "Overview", "intro": "A general introduction to the subject, providing context and foundational knowledge."},
        {"code": "413.1.1", "name": "Theory", "intro": "The study of the underlying principles and concepts of a subject."},
        {"code": "413.1.2", "name": "History", "intro": "The exploration of the historical development and evolution of a subject."},
        {"code": "413.1.3", "name": "Event", "intro": "The study of significant occurrences related to a subject."},
        {"code": "413.1.4", "name": "People", "intro": "The study of influential figures and their contributions to a subject."},
        {"code": "413.1.5", "name": "Pianolude", "intro": "The exploration of musical compositions specifically for the piano."},
        {"code": "638.7.1", "name": "Graphene(FIR)", "intro": "The study of graphene, a single layer of carbon atoms, focusing on its properties and applications."},
        {"code": "682.1.1", "name": "Operation System Overview", "intro": "An introduction to the fundamental concepts and functions of operating systems."},
        {"code": "682.1.2", "name": "Unix", "intro": "The study of the Unix operating system, focusing on its design and applications."},
        {"code": "682.1.3", "name": "Linux", "intro": "The study of the Linux operating system, emphasizing its open-source nature and community."},
        {"code": "682.1.4", "name": "RealtimeOS", "intro": "The study of operating systems designed for real-time applications."},
        {"code": "682.1.5", "name": "Windows", "intro": "The study of the Windows operating system, focusing on its features and user interface."},
        {"code": "682.1.6", "name": "macOS", "intro": "The study of the macOS operating system, emphasizing its design and integration with Apple hardware."},
        {"code": "682.1.7", "name": "iOS", "intro": "The study of the iOS operating system for mobile devices, focusing on its features and applications."},
        {"code": "682.1.8", "name": "Android", "intro": "The study of the Android operating system, emphasizing its open-source nature and mobile applications."},
        {"code": "682.1.9", "name": "HarmonyOS", "intro": "The study of HarmonyOS, focusing on its design and applications in various devices."},
        {"code": "682.1.10", "name": "Vision Pro", "intro": "The study of Vision Pro, focusing on its features and applications in augmented reality."},
        {"code": "682.2.1", "name": "Compilation Principle", "intro": "The study of the principles and processes involved in compiling programming languages."},
        {"code": "682.2.2", "name": "Data Structure", "intro": "The study of data organization and storage formats for efficient access and modification."},
        {"code": "682.2.3", "name": "Assembly Language", "intro": "The study of low-level programming languages that are closely related to machine code."},
        {"code": "682.2.4", "name": "'C/C++", "intro": "The study of the C and C++ programming languages, focusing on their syntax, features, and applications."},
        {"code": "682.2.5", "name": "Python", "intro": "The study of the Python programming language, emphasizing its simplicity and versatility."},
        {"code": "682.2.6", "name": "Java", "intro": "The study of the Java programming language, focusing on its platform independence and object-oriented features."},
        {"code": "682.2.7", "name": "TypeScript", "intro": "The study of TypeScript, a superset of JavaScript that adds static types."},
        {"code": "682.2.8", "name": "Golang", "intro": "The study of the Go programming language, emphasizing its efficiency and concurrency features."},
        {"code": "682.2.9", "name": "Rust", "intro": "The study of the Rust programming language, focusing on memory safety and performance."},
        {"code": "682.2.10", "name": "MoonBit", "intro": "The study of the MoonBit programming language, focusing on its unique features and applications."},
        {"code": "682.3.1", "name": "Software Engineering Methodology", "intro": "The study of structured approaches to software development and project management."},
        {"code": "682.3.2", "name": "Requirement Analysis", "intro": "The study of gathering and analyzing requirements for software projects."},
        {"code": "682.3.3", "name": "Design", "intro": "The study of software design principles and practices for creating effective systems."},
        {"code": "682.3.4", "name": "Construction", "intro": "The study of the implementation and coding phase of software development."},
        {"code": "682.3.5", "name": "Test", "intro": "The study of software testing methodologies and practices to ensure quality."},
        {"code": "682.3.6", "name": "Operation and Maintenance", "intro": "The study of managing and maintaining software systems post-deployment."},
        {"code": "682.3.7", "name": "Configuration Management", "intro": "The study of managing software configurations and changes throughout the development lifecycle."},
        {"code": "682.3.8", "name": "Quality Management", "intro": "The study of ensuring software quality through various management practices."},
        {"code": "682.3.9", "name": "Project Management", "intro": "The study of planning, executing, and closing projects effectively."},
        {"code": "682.5.1", "name": "TCP/IP", "intro": "The study of the TCP/IP protocol suite, focusing on networking and communication."},
        {"code": "682.5.2", "name": "Cybersecurity", "intro": "The study of protecting computer systems and networks from information disclosure and theft."},
        {"code": "682.6.1", "name": "SaaS", "intro": "The study of Software as a Service, focusing on cloud-based software delivery models."},
        {"code": "682.6.2", "name": "PaaS", "intro": "The study of Platform as a Service, focusing on cloud computing platforms for application development."},
        {"code": "682.6.3", "name": "IaaS", "intro": "The study of Infrastructure as a Service, focusing on cloud-based infrastructure solutions."},
        {"code": "682.3.1.1", "name": "Capability Maturity Model", "intro": "The study of a framework for assessing and improving software development processes."},
        {"code": "682.3.1.2", "name": "Rational Unified Process", "intro": "The study of a software development process framework that emphasizes iterative development."},
        {"code": "682.3.1.3", "name": "Waterfall Model", "intro": "The study of a linear software development model that follows a sequential design process."},
        {"code": "682.3.1.4", "name": "Agile Development", "intro": "The study of iterative and incremental software development methodologies that emphasize flexibility."},
        {"code": "682.3.2.1", "name": "UseCase Method", "intro": "The study of a technique for capturing functional requirements through use cases."},
        {"code": "682.3.2.2", "name": "UserStory Method", "intro": "The study of a technique for capturing user requirements in the form of user stories."}
    ]
}
