{
    "name": "HKC Name: Simplified Chinese",
    "intro": "HKC条目中文版本",
    "language": "zh-hans",
    "author": "PHCP Tech",
    "website": "https://hkc.wiki",
    "version": "0.1.0",
    "lastUpdate": "2024-08-31",
    "list": [
        {"code": "000", "name": "哲学", "intro": "探讨人类思维与存在的根本性学问，研究世界的本质、人类认知和思维方式。包含形而上学、认识论、逻辑学、伦理学等分支，探讨存在、知识、真理、价值等基本问题，是其他学科的理论基础，引导人类追寻智慧与真理。"},
        {"code": "100", "name": "宗教", "intro": "研究人类精神信仰体系的学科，探讨人与超自然力量的关系。包括各大宗教的教义、经典、仪式、组织形式及其历史发展，研究宗教对人类文明的影响，以及不同信仰体系间的对话与交流，体现人类对终极关怀的追求。"},
        {"code": "200", "name": "社会", "intro": "系统研究人类群体生活的各个方面，包括家庭结构、经济活动、政治制度、法律规范、社会组织等领域。探讨人类社会运行的基本规律，分析社会问题的成因与解决方案，研究社会发展与变迁的动力机制，促进社会进步。"},
        {"code": "300", "name": "文化", "intro": "研究人类精神文明发展的综合学科，涵盖教育传承、语言交流、历史演进、人类学等领域。探讨文化的形成、传播与变迁规律，研究不同文明间的交流互鉴，分析文化认同与多样性，推动人类文明的传承与创新。"},
        {"code": "400", "name": "艺术", "intro": "研究人类审美创造活动的专门领域，包括音乐、美术、文学、舞蹈、戏剧、建筑、电影等艺术形式。探讨艺术创作与欣赏的规律，分析艺术发展的历史脉络，研究艺术与社会的互动关系，促进人类精神境界的提升。"},
        {"code": "500", "name": "科学", "intro": "系统研究自然界客观规律的基础学科，包括数学、物理、化学、生物等领域。运用科学方法探索宇宙、生命和物质的本质规律，建立科学理论体系，发展实验技术与研究方法，推动人类对自然界的认知不断深入。"},
        {"code": "600", "name": "技术", "intro": "研究人类改造自然的方法与手段，涵盖医疗卫生、农业生产、工业制造、建筑工程、信息技术等应用领域。将科学理论转化为实践能力，开发先进工具与技术手段，解决现实问题，提高生产效率，改善人类生活质量。"},
        {"code": "700", "name": "新文明", "intro": "探索人类文明未来发展方向的前沿领域，研究生命科学、人工智能、太空探索等新兴科技。关注可持续发展问题，探讨人类文明演进规律，预测和引导未来社会发展，应对全球性挑战。"},
        {"code": "800", "name": "", "intro": ""},
        {"code": "900", "name": "", "intro": ""},
        {"code": "A00", "name": "", "intro": ""},
        {"code": "B00", "name": "", "intro": ""},
        {"code": "C00", "name": "", "intro": ""},
        {"code": "D00", "name": "", "intro": ""},
        {"code": "E00", "name": "", "intro": ""},
        {"code": "F00", "name": "", "intro": ""},
        {"code": "010", "name": "形而上学", "intro": "探讨存在、实在、本质等根本性哲学问题的学科，研究世界的本原和终极规律。探索时空、因果、必然性等基本范畴，分析物质与精神的关系，思考宇宙本源与人类存在的终极意义，构建系统的世界观。"},
        {"code": "020", "name": "认识论", "intro": "研究知识的本质、来源、范围和可靠性的哲学分支，探讨认知的可能性和局限性。分析知识的类型和结构，研究科学知识的形成过程，探讨真理的标准和检验方法，为人类认识活动提供理论指导。"},
        {"code": "030", "name": "逻辑学", "intro": "研究推理规则和有效论证方法的学科，包括形式逻辑、数理逻辑、模态逻辑等分支。探讨真理判断的标准和方法，分析论证的有效性和可靠性，发展逻辑推理工具，为科学研究和理性思维提供方法论基础。"},
        {"code": "040", "name": "美学", "intro": "研究审美活动、艺术本质和美的规律的哲学分支，探讨美感体验和艺术创造的本质特征。分析审美判断的标准，研究艺术作品的形式与内容，探讨自然美与艺术美的关系，揭示人类审美活动的普遍规律。"},
        {"code": "050", "name": "伦理学", "intro": "研究道德规范和价值判断的哲学分支，探讨人类行为的善恶标准和道德准则。分析道德观念的形成机制，研究个人、社会、职业等不同层面的伦理问题，探讨现代科技发展带来的新型伦理挑战，指导人类道德实践。"},
        {"code": "060", "name": "心理学", "intro": "研究人类心理现象、精神活动和行为规律的科学，包括认知、情感、意志、人格等领域。运用实验、观察等方法探索心理发展规律，研究个体差异和群体行为特征，应用于教育、咨询、管理等实践领域，促进心理健康。"},
        {"code": "070", "name": "唯识学", "intro": "佛教重要的心识理论体系，探讨意识的本质和转化。研究八识（眼耳鼻舌身意末阿赖耶识）的特性和关系，分析心理活动的根源，阐释认知过程和妄念生起的机制，指导修行者转识成智，达到解脱境界。"},
        {"code": "080", "name": "", "intro": ""},
        {"code": "090", "name": "", "intro": ""},
        {"code": "110", "name": "印度教", "intro": "起源于印度次大陆的古老宗教，是世界第三大宗教。以吠陀经典为基础，信奉梵天、湿婆、毗湿奴等诸神，形成独特的种姓制度和轮回观念。重视业力法则，发展出瑜伽、冥想等修行方法，对印度文化产生深远影响。"},
        {"code": "120", "name": "圣经信仰", "intro": "与《圣经》有紧密联系的宗教信仰，包括信仰《旧约》的犹太教，和信仰《新约》的天主教，东正教，基督新教。"},
        {"code": "130", "name": "佛教", "intro": "由释迦牟尼创立的世界性宗教，以追求觉悟解脱为核心。阐述四圣谛、八正道等基本教义，发展出大乘、小乘等不同教派。重视禅修实践，形成丰富的经典体系和寺院文化，对亚洲文明产生深远影响。"},
        {"code": "140", "name": "伊斯兰教", "intro": "由先知穆罕默德创立的一神教，是世界第二大宗教。以《古兰经》为圣典，信奉真主安拉，实行五功修行。形成逊尼派、什叶派等教派，建立完整的伊斯兰法律体系，在全球穆斯林社会具有重要影响力。"},
        {"code": "150", "name": "巴哈伊教", "intro": "19世纪在伊朗发起的新兴宗教，强调宗教统一和世界和平。提倡科学与宗教的统一，主张消除偏见、男女平等。建立独特的行政体系，发展国际性组织网络，致力于促进人类团结与社会进步。"},
        {"code": "160", "name": "民族宗教", "intro": "与特定民族文化传统紧密相连的宗教信仰体系，包括道教、神道教等。保持独特的祭祀仪式和信仰习俗，与民族认同感密切相关。融合本土文化特色，形成特有的宗教实践形式，对民族文化传承具有重要作用。"},
        {"code": "170", "name": "", "intro": ""},
		{"code": "180", "name": "", "intro": ""},
        {"code": "190", "name": "", "intro": ""},
        {"code": "210", "name": "家庭", "intro": "人类社会最基本的组织单位，承担人口繁衍、生活照料、情感支持和价值传承功能。包括婚姻关系、代际关系、家庭教育等内容，是个人社会化的重要场所，随社会发展呈现多样化形态，对社会稳定和发展具有基础性作用。"},
        {"code": "220", "name": "社会", "intro": "研究人类社会结构、社会关系和社会行为的科学，探讨社会运行和发展规律。分析社会组织、社会变迁、社会问题等现象，研究群体互动和文化传承，为社会治理和发展提供理论依据。"},
        {"code": "230", "name": "经济", "intro": "研究社会经济活动规律和资源配置的社会科学，探讨生产、分配、交换和消费等经济问题。分析市场运行机制、经济增长动力、宏观调控政策，研究国际贸易和金融体系，为经济发展和决策提供理论支持。"},
        {"code": "240", "name": "政治", "intro": "研究政治现象、政治制度和政治行为的社会科学，探讨国家治理、权力运作和政策制定的规律。分析政治体制、政党制度、选举机制等核心议题，研究国际关系和地缘政治，为现代政治发展和决策提供理论指导。"},
        {"code": "250", "name": "法律", "intro": "研究法律规范、法律制度和法律现象的社会科学，探讨法治建设和司法实践的规律。包括宪法、民法、刑法等部门法，研究法律实施和权利保护机制，促进社会公平正义，维护法治秩序。"},
        {"code": "260", "name": "国家", "intro": "具有主权的政治组织形式，是社会治理的最高权力机构。通过政府、法律等制度实现对特定领土和人口的管理，维护社会秩序，促进经济发展，保障公民权益，在国际关系中代表本国利益。"},
        {"code": "270", "name": "全球化", "intro": "世界范围内经济、政治、文化等领域日益紧密联系与相互依存的历史进程。推动国际贸易扩展、文化交流深化、科技创新共享，同时带来全球性挑战，要求加强国际合作，构建人类命运共同体。"},
        {"code": "280", "name": "管理", "intro": "研究组织管理活动规律和方法的应用性学科，探讨效率提升和资源优化配置。涵盖战略管理、组织行为、运营管理等领域，研究现代管理理论和实践创新，提高组织效能和决策水平。"},
        {"code": "290", "name": "", "intro": ""},
        {"code": "310", "name": "教育", "intro": "培养人的社会化过程，传递知识技能和文化价值的社会活动。包括学校教育、家庭教育和社会教育，强调素质培养和能力发展，是文明传承和创新的重要途径，推动个人成长和社会进步。"},
        {"code": "320", "name": "语言学", "intro": "人类最重要的交际工具和思维载体，是文化传承的核心要素。包括口语和书面语，具有符号系统、语音规则和语法结构，反映人类认知方式和文化特征，促进群体交流和文明发展。"},
        {"code": "330", "name": "历史", "intro": "研究人类社会发展演变的人文学科，记录和分析过去的事件、制度与文化。通过史料考证和历史解释，揭示历史规律和发展趋势，为现实决策提供借鉴，增强文化认同和历史意识。"},
        {"code": "340", "name": "人类学", "intro": "研究人类及其文化的综合性学科，探索人类起源、演化和文明发展。包括体质人类学、文化人类学、考古学等分支，关注文化多样性和人类适应能力，深化对人类社会的理解。"},
        {"code": "350", "name": "民族文化", "intro": "特定民族群体世代传承的生活方式和价值体系，包括物质文化和精神文化。体现在语言、习俗、艺术、信仰等方面，具有独特性和多样性，是人类文明的重要组成部分，需要保护和传承。"},
        {"code": "360", "name": "", "intro": ""},
        {"code": "370", "name": "", "intro": ""},
        {"code": "380", "name": "", "intro": ""},
        {"code": "390", "name": "", "intro": ""},
        {"code": "410", "name": "音乐", "intro": "通过声音和节奏表达情感的艺术形式，是人类最古老的艺术门类之一。包括声乐、器乐、作曲、音乐理论等领域，融合旋律、和声、节奏等要素，具有强大的情感感染力和文化表现力。"},
        {"code": "420", "name": "绘画", "intro": "以线条、色彩、明暗在平面上创造视觉形象的艺术，是重要的视觉艺术形式。包括中国画、油画、水彩等多种形式，通过对自然和社会的艺术观察与表现，传达审美情趣和人文思考。"},
        {"code": "430", "name": "文学", "intro": "运用语言文字创造审美形象的艺术，是人类精神文明的重要组成。包括诗歌、小说、戏剧等体裁，通过叙事和抒情表达人类思想情感，反映社会生活，具有独特的艺术魅力和文化价值。"},
        {"code": "440", "name": "舞蹈与戏剧", "intro": "舞蹈是通过人体动作和韵律表达情感的时空艺术，是最早的表演艺术形式。融合音乐、造型、表演等元素，包括古典舞、民族舞、现代舞等类型，展现人体美与艺术美的和谐统一。戏剧则融合表演、音乐、舞蹈等的综合舞台艺术，是重要的表演艺术形式。包括话剧、歌剧、戏曲等类型，通过舞台呈现和角色塑造，展现人物命运和社会生活，具有独特的艺术感染力。"},
        {"code": "450", "name": "雕塑", "intro": "通过塑造、雕刻等手段创作立体造型的艺术形式。包括圆雕、浮雕、雕刻等类型，运用各种材料表现人物、动物、抽象形态等题材，在建筑装饰和公共艺术中发挥重要作用。"},
        {"code": "460", "name": "摄影与电影", "intro": "运用光学和影像技术记录、创作的现代视觉艺术。摄影捕捉瞬间影像，电影则通过连续画面讲述故事。两者都是重要的视觉传播媒介，具有独特的艺术表现力和文化影响力。"},
        {"code": "470", "name": "游戏与体育", "intro": "以竞技和娱乐为主要形式的人类文化活动。包括传统体育、电子游戏等形式，强调规则和技能，既是重要的休闲方式，也是文化交流和竞技展示的平台"},
        {"code": "480", "name": "民族艺术", "intro": "各民族在历史发展中形成的独特艺术表现形式。包括民间音乐、舞蹈、戏剧、工艺等，体现民族文化特色和审美传统，是文化多样性的重要组成部分。"},
        {"code": "490", "name": "", "intro": ""},
        {"code": "510", "name": "数学", "intro": "系统研究数量关系和空间形式的基础学科，是自然科学的基础语言。包括代数、几何、分析等分支，发展抽象思维和逻辑推理能力，为其他学科提供重要的理论工具和方法支持。"},
        {"code": "520", "name": "生物学", "intro": "研究生命现象和生命规律的自然科学，探索生物的结构、功能和演化。包括分类学、遗传学、生态学等分支，揭示生命本质，推动医药、农业等领域发展，促进人类对生命的认识。"},
        {"code": "530", "name": "物理学", "intro": "研究物质结构、运动规律和相互作用的基础学科。包括力学、电磁学、量子物理等领域，探索宇宙基本规律，为工程技术发展提供理论基础，推动人类对物质世界的深入认识。"},
        {"code": "540", "name": "化学", "intro": "研究物质的组成、结构、性质及其变化规律的自然科学。包括无机化学、有机化学、物理化学等分支，探索物质转化规律，推动新材料开发和工业技术进步，服务人类生产生活。"},
        {"code": "550", "name": "地学", "intro": "研究地球系统的综合性自然科学，探索地球的形成和演化。包括地理学、地质学、大气科学、海洋学等分支，揭示地球环境变化规律，为资源开发和环境保护提供科学依据。"},
        {"code": "560", "name": "天文学", "intro": "研究宇宙天体的结构、分布和演化规律的自然科学。包括恒星、星系、宇宙学等领域，探索宇宙起源和演化，拓展人类认知边界，推动空间技术发展和宇宙探索。"},
        {"code": "570", "name": "", "intro": ""},
        {"code": "580", "name": "", "intro": ""},
        {"code": "590", "name": "", "intro": ""},
        {"code": "610", "name": "医学", "intro": "研究人体健康与疾病的应用科学，致力于预防和治疗疾病。包括基础医学、临床医学、中医药等领域，运用现代科技和传统经验，发展诊疗技术和药物研发，提高人类健康水平和生命质量。"},
        {"code": "620", "name": "农业", "intro": "研究农作物栽培和畜牧养殖的应用科学，是人类食物和原料的主要来源。包括种植业、畜牧业、渔业等领域，发展现代农业技术，提高粮食产量和质量，保障人类食物安全。"},
        {"code": "630", "name": "工业", "intro": "研究工业生产和制造技术的应用科学，是现代经济的支柱产业。包括轻工业、重工业、制造业等领域，发展自动化和智能制造，提高生产效率和产品质量，推动工业现代化。"},
        {"code": "640", "name": "建筑", "intro": "研究建筑设计和工程技术的应用科学，创造人类生存和活动空间。包括建筑设计、结构工程、建筑材料等领域，发展绿色建筑技术，提高建筑质量和居住环境，推动城市可持续发展。"},
        {"code": "650", "name": "交通", "intro": "研究运输工具和交通系统的工程科学，是现代社会的重要基础设施。包括陆运、水运、空运等方式，发展智能交通技术，提高运输效率和安全性，促进人员物资流动。"},
        {"code": "660", "name": "能源", "intro": "研究能源开发和利用的工程科学，是经济社会发展的动力来源。包括传统能源、新能源、可再生能源等类型，发展清洁能源技术，提高能源效率，推动能源结构转型。"},
        {"code": "670", "name": "航空航天", "intro": "研究航空器和航天器的尖端科技，是人类探索空间的重要工具。包括航空工程、航天工程、空间科学等领域，发展先进航空航天技术，拓展人类活动空间，推动科技创新。"},
        {"code": "680", "name": "信息与通讯", "intro": "研究信息处理和通信技术的现代科技，是数字时代的核心技术。包括计算机、通信、控制等领域，发展数字技术和网络系统，提高信息处理能力，推动数字经济发展。"},
        {"code": "690", "name": "", "intro": ""},
        {"code": "710", "name": "未来学", "intro": "研究人类社会未来发展趋势的跨学科领域，探讨可能的未来场景和演化路径。运用系统思维和预测方法，分析科技进步、社会变革、环境变化等因素的影响，为人类文明发展提供前瞻性思考。"},
        {"code": "720", "name": "超级人工智能", "intro": "超级人工智能是一种基于软件的人工智能系统，其智力范围超越人类智能。从最基本的层面上讲，这种超级人工智能具有比任何人类都先进的尖端认知功能和高度发达的思维能力。"},
        {"code": "730", "name": "人工生命", "intro": "研究人工系统中生命现象的新兴领域，探索生命的本质和创造可能。融合生物学、信息科学和材料科学，发展仿生技术和合成生物学，开拓生命科学的新疆界。"},
        {"code": "740", "name": "太阳系文明", "intro": "研究人类在太阳系范围内扩展和发展的未来形态，探索空间殖民和资源利用。包括行星改造、空间定居、资源开发等领域，为人类成为多行星物种奠定理论和技术基础。"},
        {"code": "750", "name": "银河系文明", "intro": "探讨人类文明向银河系扩展的可能性，研究星际旅行和文明接触。关注推进技术、社会组织、文化演化等议题，思考人类文明的终极发展形态和宇宙文明的本质。"},
        {"code": "760", "name": "宇宙文明", "intro": "研究宇宙尺度的文明形态和发展规律，探索智慧生命的普遍特征。包括文明分类、文明演化、文明交流等主题，探讨人类文明在宇宙进程中的定位和发展方向。"},
        {"code": "770", "name": "", "intro": ""},
        {"code": "780", "name": "", "intro": ""},
        {"code": "790", "name": "", "intro": ""},
        {"code": "011", "name": "本体论", "intro": "研究存在的本质、性质和结构的哲学分支，探讨事物的存在方式及其相互关系。分析实体、属性、事件等基本概念，揭示现实世界的基本构成，为其他哲学领域提供基础。"},
        {"code": "021", "name": "知识论", "intro": "研究知识的本质、来源、范围和可靠性的哲学分支，探讨认知的可能性和局限性。分析知识的类型和结构，研究科学知识的形成过程，探讨真理的标准和检验方法。"},
        {"code": "022", "name": "经验主义", "intro": "强调经验在知识获取中的重要性，认为知识来源于感官经验的哲学观点。探讨感知、观察和实验在知识形成中的作用，分析经验与理性之间的关系。"},
        {"code": "023", "name": "观念主义", "intro": "主张观念或思想是知识的基础，强调心灵在知识形成中的作用。探讨观念的性质、来源及其与现实世界的关系，分析思想与感知之间的互动。"},
        {"code": "031", "name": "形式逻辑", "intro": "研究推理的形式和结构的学科，探讨有效论证的规则和方法。包括命题逻辑、谓词逻辑等，分析推理的有效性和可靠性，为科学研究和理性思维提供方法论基础。"},
        {"code": "032", "name": "非形式逻辑", "intro": "研究日常推理和论证的逻辑形式，关注语言、语境和论证的实际应用。探讨逻辑谬误、论证策略等，分析非形式推理在实际交流中的作用。"},
        {"code": "041", "name": "艺术美学", "intro": "研究艺术作品的美感特征及其评价标准的哲学分支，探讨美的本质、艺术创作与欣赏的关系。分析不同艺术形式的审美体验，揭示艺术与社会、文化之间的互动。"},
        {"code": "051", "name": "元伦理学", "intro": "研究伦理学的基础和原则，探讨道德判断的本质、来源和意义。分析伦理理论的构成，关注道德语言和道德知识的性质，为伦理学的其他分支提供理论支持。"},
        {"code": "052", "name": "规范伦理学", "intro": "研究道德规范和行为标准的哲学分支，探讨什么是对的、什么是错的。分析不同伦理理论（如功利主义、义务论等）的适用性，指导人类道德实践。"},
        {"code": "053", "name": "描述伦理学", "intro": "研究人类道德行为和道德观念的实际情况，关注人们如何在特定情境中做出道德判断。通过实证研究，揭示道德行为的社会和心理因素。"},
        {"code": "054", "name": "应用伦理学", "intro": "将伦理学理论应用于具体实践领域，探讨在医疗、商业、环境等领域的道德问题。分析实际案例，提供道德决策的指导，促进社会公正与伦理责任。"},
        {"code": "061", "name": "理论心理学", "intro": "研究心理学的基本理论和原理，探讨心理现象的本质、机制和规律。关注心理学的哲学基础，为心理学的应用研究提供理论支持。"},
        {"code": "062", "name": "应用心理学", "intro": "将心理学理论应用于实际问题，研究心理学在教育、临床、组织等领域的应用。通过实证研究，促进心理健康和社会福祉。"},
        {"code": "101", "name": "宗教意义", "intro": "研究宗教信仰对人类生活和社会文化的影响，探讨宗教在道德、伦理、社会规范等方面的作用。分析不同宗教的教义、仪式和信仰实践，揭示宗教对个体和群体的意义。"},
        {"code": "102", "name": "新宗教", "intro": "研究20世纪以来新兴宗教运动的形成、发展及其社会影响。探讨新宗教的信仰体系、组织结构和文化特征，分析其对传统宗教和社会变迁的挑战与回应。"},
        {"code": "103", "name": "邪教", "intro": "研究被社会普遍认为具有极端或有害特征的宗教团体，探讨其信仰、行为和社会影响。分析邪教的形成原因、控制手段及其对成员和社会的潜在危害。"},
		{"code": "111", "name": "吠陀教", "intro": "研究源于印度的古老宗教传统，以吠陀经典为基础，探讨其教义、仪式和哲学思想。分析吠陀教对印度文化、社会结构和宗教发展的影响。"},
		{"code": "112", "name": "婆罗门教", "intro": "研究印度的主要宗教之一，强调祭祀和仪式的重要性，探讨其教义、社会地位和对印度社会的影响。分析婆罗门教在历史演变中的角色和现代发展。"},
		{"code": "113", "name": "印度教", "intro": "研究起源于印度的多神教，探讨其丰富的神话、哲学和宗教实践。分析印度教对印度社会、文化和历史的深远影响，以及其在全球的传播与变迁。"},
        {"code": "121", "name": "犹太教", "intro": "世界上最古老的一神教，是犹太民族的传统宗教。以《妥拉》为核心经典，恪守摩西十诫，强调选民意识和律法传统。形成独特的会堂制度和节期礼仪，保持严格的饮食规范，对基督教和伊斯兰教的形成有重要影响。"},
        {"code": "122", "name": "天主教", "intro": "研究基督教的一个主要分支，强调教会的权威和传统，探讨其教义、礼仪和社会影响。分析天主教在全球的传播、历史演变及其对社会的贡献与挑战。"},
        {"code": "123", "name": "东正教", "intro": "研究基督教的一个主要分支，主要流行于东欧和中东地区，探讨其教义、礼仪和文化传统。分析东正教对当地社会和历史的影响及其与其他基督教派的关系。"},
        {"code": "124", "name": "基督新教", "intro": "研究基督教的一个主要分支，强调个人信仰和圣经的权威，探讨其教义、宗派和社会影响。分析新教在历史上的发展及其对现代社会的影响。"}, 
        {"code": "131", "name": "南传佛教", "intro": "研究佛教的一个主要分支，主要流行于东南亚地区，探讨其教义、修行方法和文化特征。分析南传佛教对当地社会和文化的影响及其与其他佛教传统的关系。"},
        {"code": "132", "name": "汉传佛教", "intro": "研究佛教在中国的传播与发展，探讨其教义、经典和修行方式。分析汉传佛教对中国文化、哲学和社会的影响，以及其与道教和儒教的互动。"},
        {"code": "133", "name": "藏传佛教", "intro": "研究佛教在西藏及其周边地区的独特发展，探讨其教义、仪式和文化传统。分析藏传佛教对藏族文化、社会结构和宗教信仰的深远影响。"},
        {"code": "141", "name": "逊尼派", "intro": "研究伊斯兰教的主要分支，强调教义的传统解释和社区的共识，探讨其信仰、实践和社会影响。分析逊尼派在伊斯兰世界的地位及其与什叶派的关系。"},
        {"code": "142", "name": "什叶派", "intro": "研究伊斯兰教的一个主要分支，强调对阿里及其后裔的领导权，探讨其信仰、实践和社会影响。分析什叶派在伊斯兰世界的地位及其与逊尼派的关系。"},
        {"code": "161", "name": "道教", "intro": "研究中国的本土宗教，强调与自然和谐共生，探讨其教义、仪式和文化传统。分析道教对中国文化、哲学和社会的影响，以及其在现代社会的表现。"},
        {"code": "162", "name": "神道教", "intro": "研究日本的传统宗教，强调自然崇拜和祖先崇拜，探讨其信仰、仪式和文化特征。分析神道教对日本文化、社会和历史的影响。"},
        {"code": "163", "name": "锡克教", "intro": "研究起源于印度的宗教，强调一神论和社会平等，探讨其教义、仪式和文化传统。分析锡克教对印度社会和文化的影响及其在全球的传播。"},
        {"code": "211", "name": "两性", "intro": "研究性别差异和两性关系的社会科学，探讨性别角色、性别平等和性别认同等问题。分析文化、社会和历史对两性关系的影响，促进性别意识的提升。"},
        {"code": "212", "name": "婚姻", "intro": "研究婚姻的社会、文化和法律方面，探讨婚姻的形式、功能和变迁。分析不同文化背景下婚姻的意义及其对家庭和社会的影响。"},
        {"code": "213", "name": "育儿", "intro": "研究儿童成长和教育的社会科学，探讨育儿方式、教育理念和家庭环境对儿童发展的影响。分析社会、文化和经济因素在育儿中的作用。"},
        {"code": "221", "name": "群体组织", "intro": "研究人类社会中各种群体的形成、结构和功能，探讨群体行为、互动和社会影响。分析群体组织在社会变迁和文化传承中的作用。"},
        {"code": "222", "name": "社会制度", "intro": "研究社会中各种制度的形成、运作和变迁，探讨法律、经济、政治等制度对社会的影响。分析社会制度的功能和对人类行为的约束。"},
        {"code": "223", "name": "社会过程", "intro": "研究社会变迁和发展过程中的动态机制，探讨社会结构、文化和经济等因素的相互作用。分析社会过程对个体和群体行为的影响。"},
        {"code": "224", "name": "社会问题", "intro": "研究影响社会稳定和发展的各种问题，探讨贫困、失业、教育不平等等社会现象。分析社会问题的成因、后果及其解决方案。"},
        {"code": "231", "name": "微观经济学", "intro": "研究个体经济行为和市场机制的经济学分支，探讨消费者、生产者的决策及其对市场的影响。分析供需关系、价格形成和资源配置等问题。"},
        {"code": "232", "name": "宏观经济学", "intro": "研究整体经济运行和政策的经济学分支，探讨经济增长、通货膨胀、失业等宏观现象。分析政府政策对经济的影响及其调控手段。"},
        {"code": "233", "name": "国际经济学", "intro": "研究国家间经济关系和国际贸易的经济学分支，探讨贸易理论、国际金融和全球化等问题。分析国际经济政策对各国经济的影响。"},
        {"code": "241", "name": "政治理论", "intro": "研究政治现象和政治思想的学科，探讨权力、国家、政府等基本概念。分析不同政治理论对社会治理和政策制定的影响。"},
        {"code": "242", "name": "比较政治学", "intro": "研究不同国家和地区政治制度、行为和政策的学科，探讨政治文化、选举制度和政府形式的比较。分析比较研究对政治理论的贡献。"},
        {"code": "243", "name": "公共行政", "intro": "研究政府管理和公共政策实施的学科，探讨公共部门的组织、管理和服务。分析公共行政对社会发展的影响及其改革方向。"},
        {"code": "244", "name": "政治经济学", "intro": "研究政治与经济相互关系的学科，探讨经济政策、政治制度和社会结构的互动。分析政治经济学对社会发展的理论和实践影响。"},
        {"code": "245", "name": "国际关系", "intro": "研究国家间关系和国际事务的学科，探讨外交政策、国际组织和全球治理等问题。分析国际关系对和平与安全的影响。"},
        {"code": "251", "name": "宪法", "intro": "研究国家基本法的学科，探讨宪法的制定、实施和解释。分析宪法对国家治理、权力分配和公民权利的保障作用。"},
        {"code": "252", "name": "物权法", "intro": "研究物权的法律规范和制度，探讨物权的取得、变更和消灭。分析物权法对财产保护和经济活动的影响。"},
        {"code": "253", "name": "刑法", "intro": "研究犯罪与刑罚的法律规范，探讨刑法的基本原则、适用范围和程序。分析刑法对社会秩序和公民权利的保护作用。"},
        {"code": "254", "name": "行政法", "intro": "研究行政机关的法律规范和行为，探讨行政法的基本原则、程序和救济。分析行政法对公民权利和社会管理的影响。"},
        {"code": "255", "name": "国际法", "intro": "研究国家间关系的法律规范，探讨国际法的基本原则、条约和国际组织。分析国际法对国家行为和国际关系的约束作用。"},
        {"code": "261", "name": "政府", "intro": "研究国家治理和公共管理的机构，探讨政府的职能、结构和运作。分析政府在社会发展和公共服务中的作用。"},
        {"code": "262", "name": "外交", "intro": "研究国家间关系的管理和协调，探讨外交政策、外交手段和国际谈判。分析外交在维护国家利益和国际和平中的作用。"},
        {"code": "263", "name": "军事", "intro": "研究国家安全和军事力量的学科，探讨军事战略、战争理论和国防政策。分析军事对国家安全和国际关系的影响。"},
        {"code": "271", "name": "经济全球化", "intro": "研究全球经济一体化的过程和影响，探讨国际贸易、投资和资本流动的变化。分析经济全球化对国家和地区经济的影响。"},
        {"code": "272", "name": "政治全球化", "intro": "研究全球政治结构和治理的变化，探讨国际组织、跨国治理和全球公民社会的形成。分析政治全球化对国家主权和国际关系的影响。"},
        {"code": "273", "name": "文化全球化", "intro": "研究文化在全球范围内的传播和交融，探讨文化多样性、文化认同和文化冲突等问题。分析文化全球化对地方文化和社会的影响。"},
        {"code": "274", "name": "全球治理", "intro": "研究全球性问题的协调与管理，探讨国际合作、政策制定和全球治理机制。分析全球治理对可持续发展和国际关系的影响。"},
        {"code": "281", "name": "项目管理", "intro": "研究项目的规划、执行和控制的学科，探讨项目管理的工具、方法和最佳实践。分析项目管理对组织效率和目标实现的影响。"},
        {"code": "282", "name": "工商管理", "intro": "研究企业和组织的管理与运营，探讨战略管理、市场营销、人力资源等领域。分析工商管理对企业绩效和竞争力的影响。"},
        {"code": "283", "name": "行政管理", "intro": "研究公共部门的管理与运作，探讨行政管理的原则、方法和实践。分析行政管理对公共服务和社会发展的影响。"},
        {"code": "311", "name": "学前教育", "intro": "研究幼儿教育的理论与实践，探讨学前教育的目标、内容和方法。分析学前教育对儿童发展的重要性和社会影响。"},
        {"code": "312", "name": "初等教育", "intro": "研究小学阶段的教育理论与实践，探讨初等教育的课程、教学和评估。分析初等教育对学生全面发展的影响。"},
        {"code": "313", "name": "中等教育", "intro": "研究中学阶段的教育理论与实践，探讨中等教育的课程设置、教学方法和学生发展。分析中等教育对学生未来发展的影响。"},
        {"code": "314", "name": "高等教育", "intro": "研究大学及以上教育的理论与实践，探讨高等教育的课程、教学和科研。分析高等教育对社会进步和经济发展的贡献。"},
        {"code": "315", "name": "终身教育", "intro": "研究个人在整个生命过程中持续学习的理论与实践，探讨终身教育的理念、方法和政策。分析终身教育对个人发展和社会进步的影响。"},
        {"code": "316", "name": "图书馆学", "intro": "研究图书馆的管理、服务和信息资源的学科，探讨图书馆在信息社会中的角色和功能。分析图书馆学对知识传播和文化传承的影响。"},
        {"code": "321", "name": "社会语言学", "intro": "研究语言与社会之间关系的学科，探讨语言变异、语言态度和语言政策等问题。分析社会因素对语言使用和发展的影响。"},
        {"code": "322", "name": "心理语言学", "intro": "研究语言与心理过程之间关系的学科，探讨语言理解、产生和习得的心理机制。分析心理因素对语言使用的影响。"},
        {"code": "323", "name": "神经语言学", "intro": "研究语言与大脑之间关系的学科，探讨语言处理的神经机制和脑损伤对语言能力的影响。分析神经科学对语言研究的贡献。"},
        {"code": "324", "name": "理论语言学", "intro": "研究语言的结构、规则和系统的学科，探讨语音、语法、语义等方面的理论。分析理论语言学对语言学科的基础性作用。"},
        {"code": "331", "name": "历史学", "intro": "研究人类社会发展演变的学科，记录和分析过去的事件、制度与文化。通过史料考证和历史解释，揭示历史规律和发展趋势。"},
        {"code": "332", "name": "文献学", "intro": "研究文献的形成、传播和影响的学科，探讨文献的分类、整理和评价。分析文献学对历史研究和文化传承的作用。"},
        {"code": "333", "name": "新闻学", "intro": "研究新闻传播的理论与实践，探讨新闻的采集、编辑和发布。分析新闻学对社会舆论和公共事务的影响。"},
        {"code": "341", "name": "生物人类学", "intro": "研究人类生物特征及其演化的学科，探讨人类的起源、适应和多样性。分析生物人类学对人类学科的贡献。"},
        {"code": "342", "name": "语言人类学", "intro": "研究语言与文化之间关系的学科，探讨语言在社会交往和文化传承中的作用。分析语言人类学对人类学科的影响。"},
        {"code": "343", "name": "文化人类学", "intro": "研究人类文化的多样性和复杂性的学科，探讨文化的形成、传播和变迁。分析文化人类学对社会研究的贡献。"},
        {"code": "344", "name": "考古学", "intro": "研究人类历史和文化遗产的学科，通过发掘和分析遗址、文物等，揭示人类过去的生活方式和社会结构。"},
        {"code": "351", "name": "中国圣人崇拜", "intro": "研究中国传统文化中对圣人和贤人的崇拜现象，探讨其历史渊源、文化意义和社会影响。"},
        {"code": "352", "name": "巴西狂欢节", "intro": "研究巴西著名的节庆活动，探讨其历史、文化背景和社会意义。分析狂欢节对巴西文化和社会的影响。"},
        {"code": "411", "name": "音乐理论", "intro": "研究音乐的基本原理和构成要素的学科，探讨音高、节奏、和声等音乐元素的关系。"},
        {"code": "412", "name": "声乐", "intro": "研究人声的演唱技巧和艺术表现的学科，探讨声乐的风格、技巧和训练方法。"},
        {"code": "413", "name": "器乐", "intro": "研究各种乐器的演奏技巧和艺术表现的学科，探讨器乐的风格、技巧和训练方法。"},
        {"code": "414", "name": "西方音乐", "intro": "研究西方音乐的历史、风格和发展，探讨其对全球音乐文化的影响。"},
        {"code": "415", "name": "中国音乐", "intro": "研究中国传统音乐的历史、风格和发展，探讨其对中国文化和社会的影响。"},
        {"code": "416", "name": "印度音乐", "intro": "研究印度传统音乐的历史、风格和发展，探讨其对印度文化和社会的影响。"},
        {"code": "417", "name": "电子音乐", "intro": "研究电子技术在音乐创作和表现中的应用，探讨电子音乐的风格、技术和发展。"},
        {"code": "421", "name": "史前绘画", "intro": "研究史前时期人类的绘画艺术，探讨其形式、内容和文化意义。"},
        {"code": "422", "name": "中国画", "intro": "研究中国传统绘画艺术的风格、技法和文化内涵，探讨其在中国文化中的地位。"},
        {"code": "423", "name": "中国书法", "intro": "研究中国传统书写艺术的技法、风格和文化意义，探讨书法在中国文化中的重要性。"},
        {"code": "424", "name": "素描", "intro": "研究绘画的基础技法，探讨素描的表现形式和艺术价值。"},
        {"code": "425", "name": "水彩画", "intro": "研究水彩画的技法、风格和表现力，探讨其在绘画艺术中的地位。"},
        {"code": "426", "name": "油画", "intro": "研究油画的技法、风格和艺术表现，探讨其在绘画艺术中的发展和影响。"},
        {"code": "431", "name": "诗歌", "intro": "研究诗歌的形式、风格和艺术表现，探讨其在文学和文化中的重要性。"},
        {"code": "432", "name": "散文", "intro": "研究散文的写作技巧和艺术表现，探讨其在文学和文化中的地位。"},
        {"code": "433", "name": "剧本", "intro": "研究戏剧作品的创作和结构，探讨剧本在戏剧艺术中的重要性。"},
        {"code": "434", "name": "小说", "intro": "研究小说的叙事技巧和艺术表现，探讨其在文学和文化中的影响。"},
        {"code": "441", "name": "参与性舞蹈", "intro": "研究以参与为主的舞蹈形式，探讨其在社交、文化和艺术中的作用。"},
        {"code": "442", "name": "表演性舞蹈", "intro": "研究以表演为主的舞蹈形式，探讨其在艺术和娱乐中的表现。"},
        {"code": "443", "name": "话剧", "intro": "研究以对话和表演为主的戏剧形式，探讨其在戏剧艺术中的发展和影响。"},
        {"code": "444", "name": "歌舞剧", "intro": "研究结合音乐、舞蹈和戏剧的综合艺术形式，探讨其在文化和娱乐中的地位。"},
        {"code": "445", "name": "戏曲", "intro": "研究中国传统戏剧艺术，探讨其形式、风格和文化内涵。"},
        {"code": "446", "name": "舞台剧", "intro": "研究在舞台上表演的戏剧形式，探讨其艺术表现和文化意义。"},
        {"code": "451", "name": "雕塑", "intro": "研究立体艺术创作的技法和表现，探讨雕塑在艺术和文化中的地位。"},
        {"code": "452", "name": "陶瓷", "intro": "研究陶瓷艺术的制作技法和文化内涵，探讨陶瓷在艺术和日常生活中的应用。"},
        {"code": "453", "name": "首饰", "intro": "研究首饰设计与制作的艺术，探讨首饰在文化、时尚和社会中的意义。"},
        {"code": "461", "name": "摄影", "intro": "研究摄影艺术的技法和表现，探讨摄影在艺术和文化传播中的作用。"},
        {"code": "462", "name": "电影", "intro": "研究电影艺术的创作与表现，探讨电影在文化、娱乐和社会中的影响。"},
        {"code": "471", "name": "游戏", "intro": "研究游戏设计与体验的艺术，探讨游戏在文化、教育和娱乐中的作用。"},
        {"code": "472", "name": "电子游戏", "intro": "研究电子游戏的设计、技术和文化影响，探讨其在现代社会中的地位。"},
        {"code": "473", "name": "体育分类", "intro": "研究体育项目的分类与特征，探讨不同体育项目的文化和社会意义。"},
        {"code": "474", "name": "体育运动会", "intro": "研究体育赛事的组织与管理，探讨运动会在文化交流和社会团结中的作用。"},
        {"code": "481", "name": "中国相声", "intro": "研究中国传统相声艺术，探讨其表演形式、语言特色和文化内涵。"},
        {"code": "482", "name": "印度歌舞", "intro": "研究印度传统歌舞艺术，探讨其文化背景、表现形式和社会影响。"},
        {"code": "511", "name": "纯粹数学", "intro": "研究数学的基础理论和抽象结构，探讨数学的逻辑、证明和理论发展。"},
        {"code": "512", "name": "离散数学", "intro": "研究离散结构和离散对象的数学分支，探讨图论、组合数学等领域。"},
        {"code": "513", "name": "应用数学", "intro": "研究数学在实际问题中的应用，探讨数学模型、数值分析等技术。"},
        {"code": "521", "name": "分类学", "intro": "研究生物分类和命名的学科，探讨生物多样性和物种关系。"},
        {"code": "522", "name": "遗传学", "intro": "研究遗传现象和遗传规律的学科，探讨基因、遗传变异和遗传工程。"},
        {"code": "523", "name": "进化论", "intro": "研究生物进化的理论和机制，探讨自然选择、适应和物种形成。"},
        {"code": "524", "name": "形态学", "intro": "研究生物形态和结构的学科，探讨生物体的形态特征和功能关系。"},
        {"code": "525", "name": "生态学", "intro": "研究生物与环境之间相互关系的学科，探讨生态系统、种群和生物多样性。"},
        {"code": "526", "name": "基因学", "intro": "研究基因的结构、功能和遗传机制的学科，探讨基因组学和基因工程。"},
        {"code": "531", "name": "经典物理学", "intro": "研究物质和能量的基本规律，探讨力学、热学和电磁学等领域。"},
        {"code": "532", "name": "凝聚态物理学", "intro": "研究物质在凝聚态下的性质和行为，探讨固体和液体的物理特性。"},
        {"code": "533", "name": "原子物理学", "intro": "研究原子的结构和行为的学科，探讨原子模型、光谱和量子现象。"},
        {"code": "534", "name": "粒子物理学", "intro": "研究基本粒子及其相互作用的学科，探讨粒子加速器和标准模型。"},
        {"code": "541", "name": "无机化学", "intro": "研究无机化合物的性质、结构和反应的学科，探讨金属、矿物和配合物。"},
        {"code": "542", "name": "有机化学", "intro": "研究有机化合物的性质、结构和反应的学科，探讨碳化合物及其反应机制。"},
        {"code": "543", "name": "物理化学", "intro": "研究物质的物理性质与化学性质之间关系的学科，探讨热力学、动力学和量子化学。"},
        {"code": "544", "name": "分析化学", "intro": "研究物质成分和结构的分析方法的学科，探讨定性和定量分析技术。"},
        {"code": "551", "name": "地理学", "intro": "研究地球表面及其环境的学科，探讨自然地理和人文地理的相互关系。"},
        {"code": "552", "name": "地质学", "intro": "研究地球的组成、结构和演化的学科，探讨岩石、矿物和地质过程。"},
        {"code": "553", "name": "地球物理学", "intro": "研究地球物理特性及其变化的学科，探讨重力、磁场和地震等现象。"},
        {"code": "554", "name": "海洋学", "intro": "研究海洋及其现象的学科，探讨海洋生态、气候和资源等问题。"},
        {"code": "555", "name": "大气科学", "intro": "研究大气及其现象的学科，探讨气候、天气和大气成分等问题。"},
        {"code": "561", "name": "观测天文学", "intro": "研究天体及其运动的学科，探讨天文观测技术和数据分析。"},
        {"code": "562", "name": "太阳天文学", "intro": "研究太阳及其活动的学科，探讨太阳对地球和宇宙的影响。"},
        {"code": "563", "name": "行星天文学", "intro": "研究行星及其卫星的性质和运动的学科，探讨行星系统的形成与演化。"},
        {"code": "564", "name": "恒星天文学", "intro": "研究恒星的性质、演化和分布的学科，探讨恒星形成和死亡的过程。"},
        {"code": "565", "name": "银河系天文学", "intro": "研究银河系的结构、组成和演化的学科，探讨银河系内的天体和现象。"},
        {"code": "566", "name": "星系天文学", "intro": "研究星系的性质、分布和演化的学科，探讨星系的形成和相互作用。"},
        {"code": "567", "name": "宇宙学", "intro": "研究宇宙的起源、结构和演化的学科，探讨宇宙大爆炸、暗物质和暗能量等问题。"},
        {"code": "568", "name": "天体物理学", "intro": "研究天体及其物理性质的学科，探讨天体的形成、演化和相互作用。"},
        {"code": "569", "name": "天体化学", "intro": "研究天体及其化学组成的学科，探讨宇宙中的化学元素和分子的形成与分布。"},
        {"code": "56A", "name": "天体生物学", "intro": "研究宇宙中生命的起源、演化和分布的学科，探讨生命在宇宙中的可能性。"},
        {"code": "611", "name": "中医药", "intro": "研究中国传统医学和药物的学科，探讨中医理论、诊疗方法和药物应用。"},
        {"code": "612", "name": "人体科学", "intro": "研究人体结构、功能和健康的学科，探讨生理、解剖和生物医学等领域。"},
        {"code": "613", "name": "基础医学", "intro": "研究医学的基础理论和实践的学科，探讨生物学、化学和物理学在医学中的应用。"},
        {"code": "614", "name": "临床医学", "intro": "研究疾病的诊断、治疗和预防的学科，探讨临床实践和医学研究的结合。"},
        {"code": "621", "name": "种植业", "intro": "研究农作物的栽培和管理的学科，探讨农业生产技术和可持续发展。"},
        {"code": "622", "name": "畜牧业", "intro": "研究动物饲养和管理的学科，探讨畜牧生产技术和动物福利。"},
        {"code": "623", "name": "渔业", "intro": "研究水生生物的捕捞和养殖的学科，探讨渔业资源的可持续利用。"},
        {"code": "624", "name": "林业", "intro": "研究森林资源的管理和保护的学科，探讨林业生态和可持续发展。"},
        {"code": "631", "name": "轻工业", "intro": "研究轻工业产品的生产和管理的学科，探讨轻工业的技术和市场发展。"},
        {"code": "632", "name": "化学工业", "intro": "研究化学产品的生产和应用的学科，探讨化学工业的技术和环境影响。"},
        {"code": "633", "name": "钢铁", "intro": "研究钢铁生产和应用的学科，探讨钢铁工业的技术和市场发展。"},
        {"code": "634", "name": "汽车", "intro": "研究汽车设计、制造和管理的学科，探讨汽车工业的技术和市场趋势。"},
        {"code": "635", "name": "轮船", "intro": "研究船舶设计、建造和运营的学科，探讨航运业的技术和市场发展。"},
        {"code": "636", "name": "飞机", "intro": "研究航空器设计、制造和运营的学科，探讨航空工业的技术和市场趋势。"},
        {"code": "637", "name": "军事工业", "intro": "研究军事装备的设计、生产和管理的学科，探讨军事工业的技术和战略影响。"},
        {"code": "638", "name": "材料", "intro": "研究材料性质和应用的工程科学，是现代工业的基础。包括金属、非金属、复合材料等类型，发展新型材料技术，提高材料性能和应用范围，支持各领域技术创新。"},
        {"code": "641", "name": "建筑理论", "intro": "研究建筑设计和建造的基本原则和理论，探讨建筑的功能、形式和美学。"},
        {"code": "642", "name": "建筑历史", "intro": "研究建筑发展的历史和演变，探讨不同文化和时期的建筑风格和技术。"},
        {"code": "643", "name": "建筑美学", "intro": "研究建筑的美学特征和艺术表现，探讨建筑设计中的美学原则和文化内涵。"},
        {"code": "651", "name": "陆运", "intro": "研究陆地运输系统和交通工具的学科，探讨陆运的技术、管理和发展。"},
        {"code": "652", "name": "水运", "intro": "研究水上运输系统和交通工具的学科，探讨水运的技术、管理和发展。"},
        {"code": "653", "name": "空运", "intro": "研究空中运输系统和交通工具的学科，探讨空运的技术、管理和发展。"},
        {"code": "661", "name": "煤炭", "intro": "研究煤炭资源的开采、利用和管理的学科，探讨煤炭在能源和工业中的作用。"},
        {"code": "662", "name": "石油", "intro": "研究石油资源的开采、利用和管理的学科，探讨石油在能源和经济中的重要性。"},
        {"code": "663", "name": "天然气", "intro": "研究天然气资源的开采、利用和管理的学科，探讨天然气在能源和环境中的作用。"},
        {"code": "664", "name": "水能", "intro": "研究水能资源的开发和利用的学科，探讨水能在可再生能源中的地位。"},
        {"code": "665", "name": "风能", "intro": "研究风能资源的开发和利用的学科，探讨风能在可再生能源中的应用。"},
        {"code": "666", "name": "电能", "intro": "研究电能的生产、传输和利用的学科，探讨电能在现代社会中的重要性。"},
        {"code": "667", "name": "太阳能", "intro": "研究太阳能资源的开发和利用的学科，探讨太阳能在可再生能源中的应用。"},
        {"code": "668", "name": "地热能", "intro": "研究地热能资源的开发和利用的学科，探讨地热能在可再生能源中的潜力。"},
        {"code": "669", "name": "海洋能", "intro": "研究海洋能资源的开发和利用的学科，探讨海洋能在可再生能源中的应用。"},
        {"code": "66A", "name": "氢能", "intro": "研究氢能的生产、储存和利用的学科，探讨氢能在清洁能源中的潜力。"},
        {"code": "66B", "name": "核能", "intro": "研究核能的开发和利用的学科，探讨核能在能源生产和环境保护中的作用。"},
        {"code": "671", "name": "航空学", "intro": "研究航空器的设计、制造和运营的学科，探讨航空技术的发展和应用。"},
        {"code": "672", "name": "航天学", "intro": "研究航天器的设计、制造和运营的学科，探讨航天技术的发展和应用。"},
        {"code": "673", "name": "飞行器", "intro": "研究飞行器的设计、性能和应用的学科，探讨飞行器在航空和航天中的作用。"},
        {"code": "681", "name": "电子学", "intro": "研究电子器件和电路的学科，探讨电子技术在信息和通信中的应用。"},
        {"code": "682", "name": "计算机", "intro": "研究计算机系统和技术的学科，探讨计算机在各领域的应用和发展。"},
        {"code": "683", "name": "通信", "intro": "研究信息传递和交流的技术，探讨通信系统的设计、管理和发展。"},
        {"code": "684", "name": "控制与自动化", "intro": "研究控制系统和自动化技术的学科，探讨控制理论在工业和日常生活中的应用。"},
        {"code": "700.1", "name": "西部世界", "intro": "科幻影视剧《西部世界》探讨了未来世界中人类与具有智能的机器人之间的冲突和发展。"},
        {"code": "700.2", "name": "弗兰肯斯坦", "intro": "研究玛丽·雪莱的小说《弗兰肯斯坦》的文化影响和主题探讨。"},
        {"code": "700.3", "name": "无垠的太空", "intro": "研究宇宙探索和太空科学的主题，探讨人类对太空的理解和未来发展。"},
        {"code": "700.4", "name": "克拉克的拉玛文明", "intro": "研究阿瑟·克拉克的科幻作品及其对未来文明的构想和影响。"},
        {"code": "700.5", "name": "太空堡垒中的赛隆文明", "intro": "研究科幻作品中赛隆文明的构建及其对人类社会的启示。"},
        {"code": "700.6", "name": "星际之门中的亚特兰帝斯文明", "intro": "研究科幻作品中亚特兰帝斯文明的设定及其文化内涵。"},
        {"code": "700.7", "name": "重返群星中的异形人文明", "intro": "研究科幻作品中异形人文明的构想及其对人类未来的影响。"},
        {"code": "741", "name": "行星际航行", "intro": "研究太阳系内行星之间的航行，如地球到火星的航行。"},
        {"code": "751", "name": "星际航行", "intro": "研究飞往太阳系外恒星的航行理论与技术，探讨人类在宇宙中的探索与发展。"},
        {"code": "752", "name": "星际移民社会结构", "intro": "研究星际移民的社会组织与结构，探讨人类在外星环境中的生存与发展。"},
        {"code": "761", "name": "星系际航行", "intro": "研究飞往银河系外其他星系的航行理论与技术。"},
        {"code": "021.1", "name": "知识分类", "intro": "研究知识的分类与组织，探讨知识管理和信息检索的理论与实践。"},
        {"code": "132.0", "name": "综述", "intro": "对特定主题进行综合性研究和总结，探讨相关领域的现状与发展。"},
        {"code": "132.1", "name": "教义", "intro": "研究宗教或哲学体系中的基本信念和原则，探讨其对信徒的影响。"},
        {"code": "132.2", "name": "典籍", "intro": "研究重要文献和经典著作，探讨其历史、文化和思想价值。"},
        {"code": "132.3", "name": "宗派", "intro": "研究宗教或思想体系中的不同分支，探讨其教义、实践和社会影响。"},
        {"code": "132.4", "name": "历史", "intro": "研究特定主题或领域的历史发展，探讨其演变和影响。"},
        {"code": "132.5", "name": "人物", "intro": "研究特定历史或文化人物的生平与贡献，探讨其对社会的影响。"},
        {"code": "132.6", "name": "文化", "intro": "研究特定文化的特征、发展与影响，探讨文化在社会中的作用。"},
        {"code": "413.1", "name": "钢琴", "intro": "研究钢琴的演奏技巧、音乐理论、历史发展及其在不同音乐风格中的应用，探讨钢琴在音乐教育和表演中的重要性。"},
        {"code": "511.1", "name": "数量", "intro": "研究数量关系及其在数学中的应用，探讨数的性质、运算及其在实际问题中的解决方案，涵盖基础数学和高级数学的内容。"},
        {"code": "511.2", "name": "[结构]数论", "intro": "研究整数及其性质的数学分支，探讨素数、因数分解、同余等概念，分析数论在密码学和计算机科学中的应用。"},
        {"code": "511.3", "name": "[结构]群论", "intro": "研究代数结构中群的性质和应用，探讨群的定义、同态、子群等概念，分析群论在物理学和化学中的重要性。"},
        {"code": "511.4", "name": "[结构]图论", "intro": "研究图的性质及其在网络中的应用，探讨图的基本概念、算法及其在计算机网络、社交网络中的实际应用。"},
        {"code": "511.5", "name": "[结构]序理论", "intro": "研究序关系及其性质的数学分支，探讨偏序、全序及其在集合论和拓扑学中的应用，分析序理论的基本定理和性质。"},
        {"code": "511.6", "name": "[空间]几何", "intro": "研究空间形状、大小和相对位置的数学分支，探讨平面几何和立体几何的基本概念及其在工程和建筑中的应用。"},
        {"code": "511.7", "name": "[空间]三角", "intro": "研究三角形及其性质的数学分支，探讨三角函数、三角形的相似性和全等性，分析三角学在物理和工程中的应用。"},
        {"code": "511.8", "name": "[空间]微分几何", "intro": "研究曲线和曲面的几何性质，探讨微分几何的基本概念及其在物理学、计算机图形学中的应用，分析曲率和测地线的性质。"},
        {"code": "511.9", "name": "[空间]拓扑学", "intro": "研究空间的连续性和变换性质的数学分支，探讨拓扑空间、同伦和同调等概念，分析拓扑学在现代数学和物理中的应用。"},
        {"code": "511.10", "name": "[空间]分形", "intro": "研究自相似结构和复杂形状的数学分支，探讨分形的生成、性质及其在自然界、艺术和计算机图形中的应用。"},
        {"code": "511.11", "name": "[空间]测度论", "intro": "研究测量和量化空间的数学分支，探讨Lebesgue测度、可测函数及其在概率论和分析中的应用，分析测度的基本性质。"},
        {"code": "511.12", "name": "[变化]微积分", "intro": "研究变化率和累积量的数学分支，探讨极限、导数和积分的基本概念及其在物理、工程中的应用，分析微积分的基本定理。"},
        {"code": "511.13", "name": "[变化]向量分析", "intro": "研究多变量函数的微积分分支，探讨梯度、散度和旋度等概念，分析向量分析在物理学和工程中的应用。"},
        {"code": "511.14", "name": "[变化]微分方程", "intro": "研究描述变化过程的方程，探讨常微分方程和偏微分方程的解法及其在物理、工程中的应用，分析方程的稳定性和解的性质。"},
        {"code": "511.15", "name": "[变化]动力系统", "intro": "研究随时间变化的系统，探讨动力学模型、相空间和稳定性分析，分析动力系统在物理、生物和经济中的应用。"},
        {"code": "511.16", "name": "[变化]混沌理论", "intro": "研究非线性系统中混沌现象的数学分支，探讨混沌的特征、动力学行为及其在自然科学和工程中的应用。"},
        {"code": "511.17", "name": "[变化]复分析", "intro": "研究复数函数的性质和应用，探讨解析函数、复积分及其在物理和工程中的应用，分析复分析的基本定理和性质。"},
        {"code": "512.1", "name": "组合数学", "intro": "研究离散结构和计数问题的数学分支，探讨排列、组合、图论等概念，分析组合数学在计算机科学和优化中的应用。"},
        {"code": "512.2", "name": "计算理论", "intro": "研究计算的本质和复杂性，探讨可计算性、复杂性类及其在算法设计和计算机科学中的应用，分析计算模型的基本性质。"},
        {"code": "512.3", "name": "密码学", "intro": "研究信息安全和加密技术，探讨对称加密、非对称加密及其在网络安全中的应用，分析密码学的基本原理和算法。"},
        {"code": "512.4", "name": "图论", "intro": "研究图的性质及其在网络中的应用，探讨图的基本概念、算法及其在计算机网络、社交网络中的实际应用。"},
        {"code": "513.1", "name": "数学物理", "intro": "研究数学与物理之间的关系，探讨数学工具在物理问题中的应用，分析数学物理在理论物理和应用物理中的重要性。"},
        {"code": "513.2", "name": "数值分析", "intro": "研究数值方法和算法的数学分支，探讨数值解法、误差分析及其在科学计算中的应用，分析数值分析的基本理论和方法。"},
        {"code": "513.3", "name": "概率论", "intro": "研究随机现象和不确定性的数学分支，探讨概率模型、随机变量及其在统计学和数据分析中的应用，分析概率论的基本定理。"},
        {"code": "513.4", "name": "统计学", "intro": "研究数据收集、分析和解释的科学，探讨描述统计、推断统计及其在社会科学和自然科学中的应用，分析统计学的基本方法。"},
        {"code": "513.5", "name": "博弈论", "intro": "研究决策者在竞争环境中的策略选择，探讨博弈模型、均衡概念及其在经济学和社会科学中的应用，分析博弈论的基本原理。"},
        {"code": "513.6", "name": "运筹学", "intro": "研究优化决策和资源配置的数学分支，探讨线性规划、整数规划及其在管理科学和经济学中的应用，分析运筹学的基本方法。"},
        {"code": "513.7", "name": "控制论", "intro": "研究系统控制和反馈机制的科学，探讨控制系统的建模、分析和设计，分析控制论在工程和自动化中的应用。"},
        {"code": "526.1", "name": "基因编辑(FIR)", "intro": "研究基因编辑技术的原理和应用，探讨CRISPR等技术在生物医学和农业中的应用，分析基因编辑的伦理和社会影响。"},
        {"code": "531.1", "name": "经典力学", "intro": "研究物体运动和力的相互作用，探讨牛顿定律、动量和能量守恒等基本概念，分析经典力学在工程和物理中的应用。"},
        {"code": "531.2", "name": "声学", "intro": "研究声波的产生、传播和接收，探讨声学的基本原理及其在音乐、建筑和通信中的应用，分析声学的基本特性。"},
        {"code": "531.3", "name": "光学", "intro": "研究光的性质和行为，探讨光的传播、折射、反射及其在成像和光学仪器中的应用，分析光学的基本原理。"},
        {"code": "531.4", "name": "热力学", "intro": "研究热能和物质之间的相互作用，探讨热力学定律、热机和熵等概念，分析热力学在工程和物理中的应用。"},
        {"code": "531.5", "name": "电磁学", "intro": "研究电和磁的相互作用，探讨电场、磁场及其在电路和电磁波中的应用，分析电磁学的基本定律和现象。"},
        {"code": "561.1", "name": "天体测量学", "intro": "研究天体位置和运动的测量，探讨天文测量技术及其在天文学中的应用，分析天体测量学的基本原理和方法。"},
        {"code": "561.2", "name": "可见光天文学", "intro": "研究可见光波段的天体及其性质，探讨光谱分析、天文望远镜及其在天文学中的应用，分析可见光天文学的基本概念。"},
        {"code": "561.3", "name": "红外天文学", "intro": "研究红外波段的天体及其性质，探讨红外观测技术及其在天文学中的应用，分析红外天文学的基本原理和方法。"},
        {"code": "561.4", "name": "射电天文学", "intro": "研究射电波段的天体及其性质，探讨射电望远镜及其在天文学中的应用，分析射电天文学的基本概念和技术。"},
        {"code": "561.5", "name": "高能天文学", "intro": "研究高能粒子和辐射的天体及其性质，探讨伽马射线、X射线天文学及其在宇宙学中的应用，分析高能天文学的基本原理。"},
        {"code": "561.6", "name": "引力波天文学", "intro": "研究引力波的产生和探测，探讨引力波对宇宙事件的揭示及其在天文学中的应用，分析引力波天文学的基本概念和技术。"},
        {"code": "638.1", "name": "非金属", "intro": "研究非金属材料的性质和应用的学科，探讨非金属在工业和日常生活中的作用。"},
        {"code": "638.2", "name": "金属", "intro": "研究金属材料的性质和应用的学科，探讨金属在工业和工程中的重要性。"},
        {"code": "638.3", "name": "半导体", "intro": "研究半导体材料的性质和应用的学科，探讨半导体在电子和信息技术中的作用。"},
        {"code": "638.4", "name": "超导", "intro": "研究超导材料的性质和应用的学科，探讨超导在能源和技术中的潜在应用。"},
        {"code": "638.5", "name": "高分子", "intro": "研究高分子材料的性质和应用的学科，探讨高分子在工业和日常生活中的作用。"},
        {"code": "638.6", "name": "复合材料", "intro": "研究复合材料的性质和应用的学科，探讨复合材料在工程和技术中的优势。"},
        {"code": "638.7", "name": "纳米材料", "intro": "研究纳米尺度材料的性质和应用的学科，探讨纳米技术在各领域的创新应用。"},
        {"code": "66B.1", "name": "核聚变(FIR)", "intro": "研究核聚变反应的原理和应用，探讨核聚变在能源生产和宇宙学中的重要性，分析核聚变的基本概念和技术挑战。"},
        {"code": "682.0", "name": "计算机概论", "intro":"介绍计算机基础，包括硬件、软件、操作系统、网络和编程基础，帮助理解计算机的工作原理。"}		
        {"code": "682.1", "name": "操作系统", "intro": "研究计算机操作系统的设计、功能和应用，探讨操作系统在资源管理和用户交互中的重要性，分析操作系统的基本原理和结构。"},
        {"code": "682.2", "name": "编程语言", "intro": "研究编程语言的设计、实现和应用，探讨不同编程语言的特性及其在软件开发中的重要性，分析编程语言的基本概念和范式。"},
        {"code": "682.3", "name": "软件工程", "intro": "研究软件开发的理论和方法，探讨软件工程的最佳实践、流程和工具，分析软件工程在项目管理和质量保证中的应用。"},
        {"code": "682.4", "name": "数据库", "intro": "研究数据存储、管理和检索的系统，探讨关系型和非关系型数据库的设计及其在信息系统中的应用，分析数据库的基本原理和技术。"},
        {"code": "682.5", "name": "网络与安全", "intro": "研究计算机网络的结构、协议和安全性，探讨网络架构、数据传输及其在信息安全中的应用，分析网络安全的基本概念和技术。"},
        {"code": "682.6", "name": "云计算", "intro": "研究云计算的架构、服务模型和应用，探讨云计算在资源共享和弹性计算中的重要性，分析云计算的基本原理和技术挑战。"},
        {"code": "682.7", "name": "大数据", "intro": "研究大规模数据的存储、处理和分析，探讨大数据技术在商业、科学和社会中的应用，分析大数据的基本概念和技术方法。"},
        {"code": "682.8", "name": "区块链", "intro": "研究区块链技术的原理和应用，探讨区块链在金融、供应链和数据安全中的潜力，分析区块链的基本特性和技术挑战。"},
        {"code": "682.9", "name": "人工智能(FIR)", "intro": "研究模拟人类智能的计算系统，探讨机器学习、自然语言处理和计算机视觉等领域的应用，分析人工智能的基本原理和技术。"},
        {"code": "682.10", "name": "量子计算(FIR)", "intro": "研究利用量子力学原理进行计算的技术，探讨量子计算在复杂问题求解和信息处理中的潜力，分析量子计算的基本概念和技术挑战。"},
        {"code": "682.11", "name": "计算机应用", "intro": "研究计算机技术在各个领域的应用，探讨计算机在教育、医疗、商业等方面的影响，分析计算机应用的基本原理和发展趋势。"},
		{"code": "751.1", "name": "曲率驱动(FTL)", "intro": "研究基于曲率驱动原理的技术，探讨其在航天和物理学中的应用。"},
		{"code": "751.2", "name": "虫洞(FTL)", "intro": "通过连接宇宙不同区域的时空隧道，实现瞬间穿越远距离空间。"},
		{"code": "751.3", "name": "量子隧穿驱动(FTL)", "intro": "基于量子力学的隧穿效应，让飞船“瞬移”到星际空间的远处，而不需要逐渐加速。"},
        {"code": "413.1.0", "name": "综述", "intro": "对钢琴相关研究的全面概述，涵盖演奏技巧、音乐理论、历史发展等方面，提供对钢琴艺术的整体理解。"},
        {"code": "413.1.1", "name": "理论", "intro": "研究钢琴演奏的理论基础，包括音符、和声、节奏等音乐元素，探讨其在演奏中的应用和重要性。"},
        {"code": "413.1.2", "name": "历史", "intro": "探讨钢琴的发展历史，从早期乐器到现代钢琴的演变，分析历史背景对钢琴音乐的影响。"},
        {"code": "413.1.3", "name": "事件", "intro": "记录与钢琴相关的重要事件，如音乐会、比赛和历史性演出，分析这些事件对钢琴艺术的影响。"},
        {"code": "413.1.4", "name": "人物", "intro": "研究与钢琴相关的重要人物，包括著名钢琴家、作曲家及其对钢琴音乐的贡献，分析他们的艺术风格和影响。"},
        {"code": "413.1.5", "name": "曲目", "intro": "探讨经典钢琴曲目的分析与演奏，研究不同风格和时期的钢琴作品，分析其在音乐史上的地位。"},
        {"code": "638.7.1", "name": "石墨烯(FIR)", "intro": "研究石墨烯的性质和应用，探讨其在材料科学、电子学和能源中的潜力，分析石墨烯的基本特性和应用前景。"},
        {"code": "682.1.1", "name": "操作系统概论", "intro": "介绍操作系统的基本概念、功能和结构，探讨操作系统在计算机系统中的重要性和作用。"},
        {"code": "682.1.2", "name": "Unix", "intro": "研究Unix操作系统的设计理念、功能和应用，探讨其在服务器和开发环境中的重要性。"},
        {"code": "682.1.3", "name": "Linux", "intro": "研究Linux操作系统的开源特性、功能和应用，探讨其在服务器、嵌入式系统中的广泛使用。"},
        {"code": "682.1.4", "name": "RealtimeOS", "intro": "研究实时操作系统的设计和应用，探讨其在嵌入式系统和工业控制中的重要性。"},
        {"code": "682.1.5", "name": "Windows", "intro": "研究Windows操作系统的功能、界面和应用，探讨其在个人计算机和企业环境中的广泛使用。"},
        {"code": "682.1.6", "name": "macOS", "intro": "研究macOS操作系统的设计理念、功能和应用，探讨其在创意产业和个人用户中的重要性。"},
        {"code": "682.1.7", "name": "iOS", "intro": "研究iOS操作系统的设计、功能和应用，探讨其在移动设备中的影响和用户体验。"},
        {"code": "682.1.8", "name": "Android", "intro": "研究Android操作系统的开源特性、功能和应用，探讨其在智能手机中的主导地位和生态系统。"},
        {"code": "682.1.9", "name": "HarmonyOS", "intro": "研究HarmonyOS的设计、功能和应用，探讨其在物联网和智能设备中的潜力和发展。"},
        {"code": "682.1.10", "name": "Vision Pro", "intro": "研究Vision Pro的设计、功能和应用，探讨其在增强现实和虚拟现实中的作用和影响。"},
        {"code": "682.2.1", "name": "编译原理", "intro": "研究编译器的设计和实现，探讨编译过程中的各个阶段和技术，分析编译原理在程序开发中的重要性。"},
        {"code": "682.2.2", "name": "数据结构", "intro": "研究数据的组织和存储方式，探讨数据结构在算法和程序设计中的应用，分析数据结构的基本概念和类型。"},
        {"code": "682.2.3", "name": "汇编语言", "intro": "研究汇编语言的语法、结构和应用，探讨其在计算机系统中的作用和重要性。"},
        {"code": "682.2.4", "name": "C/C++", "intro": "研究C和C++编程语言的语法、特性和应用，探讨其在软件开发中的重要性和广泛使用。"},
        {"code": "682.2.5", "name": "Python", "intro": "研究Python编程语言的语法、特性和应用，探讨其在数据科学、人工智能中的广泛使用和优势。"},
        {"code": "682.2.6", "name": "Java", "intro": "研究Java编程语言的语法、特性和应用，探讨其在企业级应用和移动开发中的重要性和影响。"},
        {"code": "682.2.7", "name": "TypeScript", "intro": "研究TypeScript编程语言的特性和应用，探讨其在大型JavaScript应用中的优势和使用场景。"},
        {"code": "682.2.8", "name": "Golang", "intro": "研究Go编程语言的特性和应用，探讨其在云计算和微服务中的优势和发展前景。"},
        {"code": "682.2.9", "name": "Rust", "intro": "研究Rust编程语言的特性和应用，探讨其在系统编程和安全性方面的优势和应用场景。"},
        {"code": "682.2.10", "name": "MoonBit", "intro": "研究MoonBit编程语言的特性和应用，探讨其在区块链和加密货币中的作用和发展。"},
        {"code": "682.3.1", "name": "软件工程方法论", "intro": "研究软件开发的理论和方法，探讨软件工程的最佳实践和流程，分析软件工程在项目管理中的应用。"},
        {"code": "682.3.2", "name": "需求分析", "intro": "研究软件需求的获取和分析，探讨需求分析在软件开发中的重要性和方法，分析需求文档的编写。"},
        {"code": "682.3.3", "name": "软件设计", "intro": "研究软件系统的设计原则和方法，探讨软件设计在开发过程中的作用，分析设计模式和架构的应用。"},
        {"code": "682.3.4", "name": "软件构造", "intro": "研究软件系统的构建和实现，探讨软件构造的技术和工具，分析构造过程中的挑战和解决方案。"},
        {"code": "682.3.5", "name": "软件测试", "intro": "研究软件测试的理论和方法，探讨软件测试在保证软件质量中的作用，分析测试用例的设计和执行。"},
        {"code": "682.3.6", "name": "软件运维", "intro": "研究软件系统的维护和管理，探讨软件运维在软件生命周期中的重要性，分析运维工具和流程的应用。"},
        {"code": "682.3.7", "name": "配置管理", "intro": "研究软件配置的管理和控制，探讨配置管理在软件开发中的作用，分析版本控制和变更管理的实践。"},
        {"code": "682.3.8", "name": "质量管理", "intro": "研究软件质量的管理和控制，探讨质量管理在软件开发中的重要性，分析质量保证和改进的策略。"},
        {"code": "682.3.9", "name": "项目管理", "intro": "研究项目的规划、执行和控制，探讨项目管理在软件开发中的应用，分析项目生命周期和管理工具的使用。"},
        {"code": "682.5.1", "name": "TCP/IP", "intro": "研究TCP/IP协议的结构和功能，探讨其在网络通信中的应用，分析TCP/IP协议的基本原理和实现。"},
        {"code": "682.5.2", "name": "安全", "intro": "研究网络安全的基本概念和技术，探讨信息安全、数据保护及其在网络环境中的应用，分析安全策略和措施。"},
        {"code": "682.6.1", "name": "软件即服务", "intro": "研究软件即服务(SaaS)的概念和应用，探讨其在云计算中的重要性和优势，分析SaaS的商业模式和发展趋势。"},
        {"code": "682.6.2", "name": "平台即服务", "intro": "研究平台即服务(PaaS)的概念和应用，探讨其在云计算中的重要性和优势，分析PaaS的商业模式和发展趋势。"},
        {"code": "682.6.3", "name": "基础设施即服务", "intro": "研究基础设施即服务(IaaS)的概念和应用，探讨其在云计算中的重要性和优势，分析IaaS的商业模式和发展趋势。"},
        {"code": "682.3.1.1", "name": "软件能力成熟度模型", "intro": "研究软件能力成熟度模型(CMM)的理论和应用，探讨其在软件开发过程中的重要性和实施方法。"},
        {"code": "682.3.1.2", "name": "Ration统一过程", "intro": "研究Ration统一过程的理论和实践，探讨其在软件开发中的应用和优势，分析统一过程的基本原则。"},
        {"code": "682.3.1.3", "name": "瀑布模型", "intro": "研究瀑布模型的基本概念和应用，探讨其在软件开发中的优缺点，分析瀑布模型的实施过程。"},
        {"code": "682.3.1.4", "name": "敏捷开发", "intro": "研究敏捷开发的原则和方法，探讨其在软件开发中的应用和优势，分析敏捷开发的实践案例。"},
        {"code": "682.3.2.1", "name": "UseCase方法", "intro": "研究UseCase方法的理论和应用，探讨其在需求分析中的重要性和实施方法，分析UseCase的基本结构。"},
        {"code": "682.3.2.2", "name": "UserStory方法", "intro": "研究UserStory方法的理论和应用，探讨其在需求分析中的重要性和实施方法，分析UserStory的基本结构。"}
    ]
}
